alexeyk13/rexos/drv/stm32/stm32_regsusb.h
/*
    RExOS - embedded RTOS
    Copyright (c) 2011-2016, Alexey Kramarenko
    All rights reserved.
*/

#ifndef STM32_REGSUSB_H
#define STM32_REGSUSB_H

#include <stdint.h>

/******************************************************************************/
/*                                                                            */
/*                            OTG High Speed                                  */
/*                                                                            */
/******************************************************************************/

typedef struct {
    __IO uint32_t OTGCTL;     //0x00 Control and status register
    __IO uint32_t OTGINT;     //0x04 Interrupt register
    __IO uint32_t AHBCFG;     //0x08 AHB configuration register
    __IO uint32_t USBCFG;     //0x0c USB configuration register
    __IO uint32_t RSTCTL;     //0x10 Reset register
    __IO uint32_t INTSTS;     //0x14 Core interrupt register
    __IO uint32_t INTMSK;     //0x18 Interrupt mask register
    __I  uint32_t RXSTSR;     //0x1c Receive status debug read/ORG status read register
    __IO uint32_t RXSTSP;     //0x20 Receive status debug pop/ORG status pop register
    __IO uint32_t RXSFSIZ;    //0x24 Receive FIFO size register
    __IO uint32_t TX0FSIZ;    //0x28 Host: Nonperiodic transmit FIFO size, device: EP0 transmit FIFO size register
    __I  uint32_t NPTXSTS;    //0x2c Host only: Nonperiodic transmit FIFO/queue status register
    __IO uint32_t I2CCTL;      //0x30 I2C access register
    __I  uint32_t RESERVED;      //0x34
    __IO uint32_t CCFG;          //0x38 Core configuration register
    __IO uint32_t CID;          //0x3c Core ID register
    __I  uint32_t RESERVED1[48];//0x40..0xfc
    __IO uint32_t HPTXFSIZ;     //0x100 Host periodic transmit FIFO size register
    __IO uint32_t DIEPTXF[7];//0x104 + (n *4) device IN endpoint transmit FIFO size register
} OTG_HS_GENERAL_TypeDef;

typedef struct {
    __IO uint32_t CHAR;            //+0x00 characteristics register
    __IO uint32_t SPLT;            //+0x04 split control register
    __IO uint32_t INT;            //+0x08 interrupt register
    __IO uint32_t INTMSK;        //+0x0c interrupt mask register
    __IO uint32_t HCTSIZ;        //+0x10 transfer size register
    __IO uint32_t DMA;            //+0x14 DMA address register
    __I  uint32_t RESERVED[2];    //+0x18..0x1c
} OTG_HS_HOST_CHANNEL_TypeDef;

typedef struct {
    __IO uint32_t CFG;            //0x400 configuration register
    __IO uint32_t FIR;            //0x404 frame interval register
    __IO uint32_t FNUM;            //0x408 frame number/frame time remaining register
    __I  uint32_t RESERVED;       //0x40c
    __IO uint32_t PTXSTS;        //0x410 periodic transmit FIFO/queue status register
    __IO uint32_t AINT;            //0x414 all channels interrupt register
    __IO uint32_t AINTMSK;        //0x418 all channels interrupt mask register
    __I  uint32_t RESERVED1[9];//0x41c..0x43c
    __IO uint32_t PRT;            //0x440 port control and status register
    __IO uint32_t RESERVED2[47];//0x444..0x4fc
    OTG_HS_HOST_CHANNEL_TypeDef CHANNEL[12];//0x500 0x20 * 12 channel control
} OTG_HS_HOST_TypeDef;

typedef struct {
    __IO uint32_t CTL;            //+0x00 control register
    __I  uint32_t RESERVED;       //+0x04
    __IO uint32_t INT;            //+0x08 interrupt register
    __I  uint32_t RESERVED1;   //+0x0c
    __IO uint32_t TSIZ;            //+0x10 transfer size register
    __IO uint32_t DMAADDR;        //+0x14 DMA address
    __IO uint32_t FSTS;            //+0x18 IN endpoint TxFIFO status register
    __I  uint32_t RESERVED2;   //+0x1c
} OTG_HS_DEVICE_ENDPOINT_TypeDef;

typedef struct {
    __IO uint32_t CFG;            //0x800 device configuration register
    __IO uint32_t CTL;            //0x804 device control register
    __IO uint32_t STS;            //0x808 device status register
    __I  uint32_t RESERVED;       //0x80c
    __IO uint32_t IEPMSK;        //0x810 device IN endpoint common interrupt mask register
    __IO uint32_t OEPMSK;        //0x814 device OUT endpoint common interrupt mask register
    __IO uint32_t AINT;            //0x818 all endpoints interrupt register
    __IO uint32_t AINTMSK;        //0x81c all endpoints interrupt mask register
    __I  uint32_t RESERVED1[2];//0x820..0x824
    __IO uint32_t VBUSDIS;        //0x828 VBUS discharge time register
    __IO uint32_t VBUSPULSE;    //0x82c VBUS pulsing time register
    __IO uint32_t THRCTL;        //0x830 threshold control register
    __IO uint32_t EIPEMPMSK;    //0x834 IN endpoint FIFO empty interrupt mask register
    __IO uint32_t EACHINT;        //0x838 each endpoint interrupt register
    __IO uint32_t EACHINTMSK;    //0x83c each endpoint interrupt mask register
    __IO uint32_t IEPEACHMSK1;    //0x840 each IN endpoint-1 interrupt register
    __I  uint32_t RESERVED2[15];//0x844..0x87c
    __IO uint32_t OEPEACHMSK1;    //0x880 each OUT endpoint-1 interrupt register
    __I  uint32_t RESERVED3[31];//0x884..0x8fc
    OTG_HS_DEVICE_ENDPOINT_TypeDef INEP[16];//0x900.. 0xafc IN EP configs
    OTG_HS_DEVICE_ENDPOINT_TypeDef OUTEP[16];//0xB00.. 0xcfc OUT EP configs
} OTG_HS_DEVICE_TypeDef;

typedef struct {
    __IO uint32_t GCCTL;            //0xE00 power and clock gating control register
} OTG_HS_PC_TypeDef;

#define OTG_HS_BASE                (AHB1PERIPH_BASE + 0x00020000)
#define OTG_HS_GENERAL_BASE    (OTG_HS_BASE + 0x0000)
#define OTG_HS_HOST_BASE        (OTG_HS_BASE + 0x0400)
#define OTG_HS_DEVICE_BASE        (OTG_HS_BASE + 0x0800)
#define OTG_HS_PC_BASE            (OTG_HS_BASE + 0x0e00)

#define OTG_HS_GENERAL        ((OTG_HS_GENERAL_TypeDef *) OTG_HS_GENERAL_BASE)
#define OTG_HS_HOST             ((OTG_HS_HOST_TypeDef *) OTG_HS_HOST_BASE)
#define OTG_HS_DEVICE          ((OTG_HS_DEVICE_TypeDef *) OTG_HS_DEVICE_BASE)
#define OTG_HS_PC                  ((OTG_HS_PC_TypeDef *) OTG_HS_PC_BASE)

/******************************************************************************/
/*                         Peripheral Registers_Bits_Definition               */
/******************************************************************************/

/******************************************************************************/
/*                                                                            */
/*                            OTG High Speed GENERAL                          */
/*                                                                            */
/******************************************************************************/
/**********  Bit definition for OTG_HS_GENERAL_OTGCTL register  ***************/
#define  OTG_HS_GENERAL_OTGCTL_BSVLD                        (uint32_t)(1ul << 19ul) //B-session valid
#define  OTG_HS_GENERAL_OTGCTL_ASVLD                        (uint32_t)(1ul << 18ul) //A-session valid
#define  OTG_HS_GENERAL_OTGCTL_DBCT                            (uint32_t)(1ul << 17ul) //Long/short debounce time
#define  OTG_HS_GENERAL_OTGCTL_CITST                        (uint32_t)(1ul << 16ul) //Connector ID status
#define  OTG_HS_GENERAL_OTGCTL_DHNPEN                        (uint32_t)(1ul << 11ul) //Device HNP enabled
#define  OTG_HS_GENERAL_OTGCTL_HSHNPEN                        (uint32_t)(1ul << 10ul) //Host set HNP enabled
#define  OTG_HS_GENERAL_OTGCTL_HNPRQ                        (uint32_t)(1ul << 9ul)  //HNP request
#define  OTG_HS_GENERAL_OTGCTL_HNGSCS                        (uint32_t)(1ul << 8ul)  //Host negotiations success
#define  OTG_HS_GENERAL_OTGCTL_SRQ                            (uint32_t)(1ul << 1ul)  //Session request
#define  OTG_HS_GENERAL_OTGCTL_SRQSCS                        (uint32_t)(1ul << 0ul)  //Session request success

/**********  Bit definition for OTG_HS_GENERAL_OTGINT register  ***************/
#define  OTG_HS_GENERAL_OTGINT_DBCDNE                        (uint32_t)(1ul << 19ul) //Debounce done
#define  OTG_HS_GENERAL_OTGINT_ADTOCHG                        (uint32_t)(1ul << 18ul) //A-device timeout change
#define  OTG_HS_GENERAL_OTGINT_HNGDET                        (uint32_t)(1ul << 17ul) //Host negotiation detected
#define  OTG_HS_GENERAL_OTGINT_HNSSCHG                        (uint32_t)(1ul << 9ul)  //Host negotiation success status change
#define  OTG_HS_GENERAL_OTGINT_SRSSCHG                        (uint32_t)(1ul << 8ul)  //Session request success status change
#define  OTG_HS_GENERAL_OTGINT_SEDET                        (uint32_t)(1ul << 2ul)  //Session end detected

