alexeyk13/rexos/drv/stm32/stm32_regsusb.h
/**********  Bit definition for OTG_HS_GENERAL_AHBCFG register  ***************/
#define  OTG_HS_GENERAL_AHBCFG_PTXFELVL                    (uint32_t)(1ul << 8ul)  //Periodic TxFIFO empty level
#define  OTG_HS_GENERAL_AHBCFG_TXFELVL                        (uint32_t)(1ul << 7ul)  //TxFIFO empty level
#define  OTG_HS_GENERAL_AHBCFG_DMAEN                        (uint32_t)(1ul << 5ul)  //DMA enable
#define  OTG_HS_GENERAL_AHBCFG_HBSTLEN                        (uint32_t)(0xful << 1ul)//Burst length/type
#define  OTG_HS_GENERAL_AHBCFG_GINT                            (uint32_t)(1ul << 0ul)  //Global interrupt mask

#define  OTG_HS_GENERAL_AHBCFG_HBSTLEN_SINGLE            (uint32_t)(0x0ul << 1ul)
#define  OTG_HS_GENERAL_AHBCFG_HBSTLEN_INCR                (uint32_t)(0x1ul << 1ul)
#define  OTG_HS_GENERAL_AHBCFG_HBSTLEN_INCR4                (uint32_t)(0x3ul << 1ul)
#define  OTG_HS_GENERAL_AHBCFG_HBSTLEN_INCR8                (uint32_t)(0x5ul << 1ul)
#define  OTG_HS_GENERAL_AHBCFG_HBSTLEN_INCR16            (uint32_t)(0x7ul << 1ul)

/**********  Bit definition for OTG_HS_GENERAL_USBCFG register  ***************/
#define  OTG_HS_GENERAL_USBCFG_CTXPKT                        (uint32_t)(1ul << 31ul) //Corrupt Tx packet
#define  OTG_HS_GENERAL_USBCFG_FDMOD                        (uint32_t)(1ul << 30ul) //Forced peripheral mode
#define  OTG_HS_GENERAL_USBCFG_FHMOD                        (uint32_t)(1ul << 29ul) //Forced host mode
#define  OTG_HS_GENERAL_USBCFG_ULPIPD                        (uint32_t)(1ul << 25ul) //ULPI interface protect disable
#define  OTG_HS_GENERAL_USBCFG_PTCI                            (uint32_t)(1ul << 24ul) //Indicator passthru
#define  OTG_HS_GENERAL_USBCFG_PCCI                            (uint32_t)(1ul << 23ul) //Indicator complement
#define  OTG_HS_GENERAL_USBCFG_TSDPS                        (uint32_t)(1ul << 22ul) //TermSel DLine pulsing selection
#define  OTG_HS_GENERAL_USBCFG_ULPIEVBUSI                    (uint32_t)(1ul << 21ul) //ULPI external VBus indicator
#define  OTG_HS_GENERAL_USBCFG_ULPIEVBUSD                    (uint32_t)(1ul << 20ul) //ULPI external VBus drive
#define  OTG_HS_GENERAL_USBCFG_ULPICSM                        (uint32_t)(1ul << 19ul) //ULPI Clock SuspendM
#define  OTG_HS_GENERAL_USBCFG_ULPIAR                        (uint32_t)(1ul << 18ul) //ULPI Auto-resume
#define  OTG_HS_GENERAL_USBCFG_ULPIFSLS                    (uint32_t)(1ul << 17ul) //ULPI FS/LS select
#define  OTG_HS_GENERAL_USBCFG_PHYLPCS                        (uint32_t)(1ul << 15ul) //PHY low power clock select
#define  OTG_HS_GENERAL_USBCFG_TRDT                            (uint32_t)(0xful << 10ul)//USB turn around time
#define  OTG_HS_GENERAL_USBCFG_HNPCAP                        (uint32_t)(1ul << 9ul)  //HNP-capable
#define  OTG_HS_GENERAL_USBCFG_SRPCAP                        (uint32_t)(1ul << 8ul)  //SRP-capable
#define  OTG_HS_GENERAL_USBCFG_PHYSEL                        (uint32_t)(1ul << 6ul)  //USB 2.0 high-speed ULPI PHY or USB 1.1 full speed serial tranceiver
#define  OTG_HS_GENERAL_USBCFG_TOCAL                        (uint32_t)(7ul << 0ul)  //FS timeout calibration

#define  OTG_HS_GENERAL_USBCFG_TRDT_POS                    (uint32_t)(10ul)
#define  OTG_HS_GENERAL_USBCFG_TOCAL_POS        \            (uint32_t)(0ul)

/**********  Bit definition for OTG_HS_GENERAL_RSTCTL register  ***************/
#define  OTG_HS_GENERAL_RSTCTL_AHBIDL                        (uint32_t)(1ul << 31ul)  //AHB master idle
#define  OTG_HS_GENERAL_RSTCTL_DMAREQ                        (uint32_t)(1ul << 30ul)  //DMA request
#define  OTG_HS_GENERAL_RSTCTL_TXFNUM                        (uint32_t)(0x1ful << 6ul)//TxFIFO number
#define  OTG_HS_GENERAL_RSTCTL_TXFFLSH                        (uint32_t)(1ul << 5ul)   //TxFIFO flush
#define  OTG_HS_GENERAL_RSTCTL_RXFFLSH                        (uint32_t)(1ul << 4ul)   //RxFIFO flush
#define  OTG_HS_GENERAL_RSTCTL_FCRST                        (uint32_t)(1ul << 2ul)   //Host frame counter reset
#define  OTG_HS_GENERAL_RSTCTL_HSRST                        (uint32_t)(1ul << 1ul)   //HCLK soft reset
#define  OTG_HS_GENERAL_RSTCTL_CSRST                        (uint32_t)(1ul << 0ul)   //CORE soft reset

#define  OTG_HS_GENERAL_RSTCTL_TXFNUM_POS                    (uint32_t)(6ul)

/**********  Bit definition for OTG_HS_GENERAL_INTSTS register  ***************/
#define  OTG_HS_GENERAL_INTSTS_WKUPINT                        (uint32_t)(1ul << 31ul)  //Resume/remote wakeup detected interrupt
#define  OTG_HS_GENERAL_INTSTS_SRQINT                        (uint32_t)(1ul << 30ul)  //Session request/new session detected interrupt
#define  OTG_HS_GENERAL_INTSTS_DISCINT                        (uint32_t)(1ul << 29ul)  //Disconnect detected interrupt
#define  OTG_HS_GENERAL_INTSTS_CIDSCHG                        (uint32_t)(1ul << 28ul)  //Connector ID status change
#define  OTG_HS_GENERAL_INTSTS_PTXFE                        (uint32_t)(1ul << 26ul)  //Periodic TxFIFO empty
#define  OTG_HS_GENERAL_INTSTS_HCINT                        (uint32_t)(1ul << 25ul)  //Host channel interrupt
#define  OTG_HS_GENERAL_INTSTS_HPRTINT                        (uint32_t)(1ul << 24ul)  //Host port interrupt
#define  OTG_HS_GENERAL_INTSTS_DATAFSUSP                    (uint32_t)(1ul << 22ul)  //Data fetch suspended
#define  OTG_HS_GENERAL_INTSTS_IPXFR                        (uint32_t)(1ul << 21ul)  //Host: incomplete periodic transfer
#define  OTG_HS_GENERAL_INTSTS_INCOMPISOOUT                (uint32_t)(1ul << 21ul)  //Device: incomplete isochronous OUT transfer
#define  OTG_HS_GENERAL_INTSTS_ISOIXFR                        (uint32_t)(1ul << 20ul)  //Incomplete isochronous transfer
#define  OTG_HS_GENERAL_INTSTS_OEPINT                        (uint32_t)(1ul << 19ul)  //OUT endpoint interrupt
#define  OTG_HS_GENERAL_INTSTS_IEPINT                        (uint32_t)(1ul << 18ul)  //IN endpoint interrupt
#define  OTG_HS_GENERAL_INTSTS_EOPF                            (uint32_t)(1ul << 15ul)  //End of periodic frame interrupt
#define  OTG_HS_GENERAL_INTSTS_ISOODRP                        (uint32_t)(1ul << 14ul)  //Isochronous OUT packet dropped interrupt
#define  OTG_HS_GENERAL_INTSTS_ENUMDNE                        (uint32_t)(1ul << 13ul)  //Enumeration done interrupt
#define  OTG_HS_GENERAL_INTSTS_USBRST                        (uint32_t)(1ul << 12ul)  //USB reset
#define  OTG_HS_GENERAL_INTSTS_USBSUSP                        (uint32_t)(1ul << 11ul)  //USB suspend
#define  OTG_HS_GENERAL_INTSTS_ESUSP                        (uint32_t)(1ul << 10ul)  //Early suspend
#define  OTG_HS_GENERAL_INTSTS_GONAKEFF                    (uint32_t)(1ul << 7ul)   //Global OUT NAK effective
#define  OTG_HS_GENERAL_INTSTS_GINAKEFF                    (uint32_t)(1ul << 6ul)   //Global OUT nonperiodic NAK effective
#define  OTG_HS_GENERAL_INTSTS_NPTXFE                        (uint32_t)(1ul << 5ul)   //Nonperiodic TxFIFO empty
#define  OTG_HS_GENERAL_INTSTS_RXFLVL                        (uint32_t)(1ul << 4ul)   //RxFIFO nonempty
#define  OTG_HS_GENERAL_INTSTS_SOF                            (uint32_t)(1ul << 3ul)   //Start of frame
#define  OTG_HS_GENERAL_INTSTS_OTGINT                        (uint32_t)(1ul << 2ul)   //OTG interrupt
#define  OTG_HS_GENERAL_INTSTS_MMIS                            (uint32_t)(1ul << 1ul)   //Mode mismatch interrupt
#define  OTG_HS_GENERAL_INTSTS_CMOD                            (uint32_t)(1ul << 0ul)   //Current mode operation

/**********  Bit definition for OTG_HS_GENERAL_INTMSK register  ***************/
#define  OTG_HS_GENERAL_INTMSK_WKUPM                        (uint32_t)(1ul << 31ul)  //Resume/remote wakeup detected interrupt mask
#define  OTG_HS_GENERAL_INTMSK_SRQM                            (uint32_t)(1ul << 30ul)  //Session request/new session detected interrupt mask
#define  OTG_HS_GENERAL_INTMSK_DISCM                        (uint32_t)(1ul << 29ul)  //Disconnect detected interrupt mask
#define  OTG_HS_GENERAL_INTMSK_CIDSCHGM                    (uint32_t)(1ul << 28ul)  //Connector ID status change mask
#define  OTG_HS_GENERAL_INTMSK_PTXFEM                        (uint32_t)(1ul << 26ul)  //Periodic TxFIFO empty mask
#define  OTG_HS_GENERAL_INTMSK_HCM                            (uint32_t)(1ul << 25ul)  //Host channel interrupt mask
#define  OTG_HS_GENERAL_INTMSK_HPRTM                        (uint32_t)(1ul << 24ul)  //Host port interrupt mask
#define  OTG_HS_GENERAL_INTMSK_DATAFSUSPM                    (uint32_t)(1ul << 22ul)  //Data fetch suspended mask
#define  OTG_HS_GENERAL_INTMSK_IPXFRM                        (uint32_t)(1ul << 21ul)  //Host: incomplete periodic transfer mask
#define  OTG_HS_GENERAL_INTMSK_INCOMPISOOUTM                (uint32_t)(1ul << 21ul)  //Device: incomplete isochronous OUT transfer mask
#define  OTG_HS_GENERAL_INTMSK_ISOIXFRM                    (uint32_t)(1ul << 20ul)  //Incomplete isochronous transfer mask
#define  OTG_HS_GENERAL_INTMSK_OEPM                            (uint32_t)(1ul << 19ul)  //OUT endpoint interrupt mask
#define  OTG_HS_GENERAL_INTMSK_IEPM                            (uint32_t)(1ul << 18ul)  //IN endpoint interrupt mask
#define  OTG_HS_GENERAL_INTMSK_EPMISM                        (uint32_t)(1ul << 17ul)  //Endpoint mismatch interrupt mask
#define  OTG_HS_GENERAL_INTMSK_EOPFM                        (uint32_t)(1ul << 15ul)  //End of periodic frame interrupt mask
#define  OTG_HS_GENERAL_INTMSK_ISOODRPM                    (uint32_t)(1ul << 14ul)  //Isochronous OUT packet dropped interrupt mask
#define  OTG_HS_GENERAL_INTMSK_ENUMDNEM                    (uint32_t)(1ul << 13ul)  //Enumeration done interrupt mask
#define  OTG_HS_GENERAL_INTMSK_USBRSTM                        (uint32_t)(1ul << 12ul)  //USB reset mask
#define  OTG_HS_GENERAL_INTMSK_USBSUSPM                    (uint32_t)(1ul << 11ul)  //USB suspend mask
#define  OTG_HS_GENERAL_INTMSK_ESUSPM                        (uint32_t)(1ul << 10ul)  //Early suspend mask
#define  OTG_HS_GENERAL_INTMSK_GONAKEFFM                    (uint32_t)(1ul << 7ul)   //Global OUT NAK effective mask
#define  OTG_HS_GENERAL_INTMSK_GINAKEFFM                    (uint32_t)(1ul << 6ul)   //Global OUT nonperiodic NAK effective mask
#define  OTG_HS_GENERAL_INTMSK_NPTXFEM                        (uint32_t)(1ul << 5ul)   //Nonperiodic TxFIFO empty mask
#define  OTG_HS_GENERAL_INTMSK_RXFLVLM                        (uint32_t)(1ul << 4ul)   //RxFIFO nonempty mask
#define  OTG_HS_GENERAL_INTMSK_SOFM                            (uint32_t)(1ul << 3ul)   //Start of frame mask
#define  OTG_HS_GENERAL_INTMSK_OTGM                            (uint32_t)(1ul << 2ul)   //OTG interrupt mask
#define  OTG_HS_GENERAL_INTMSK_MMISM                        (uint32_t)(1ul << 1ul)   //Mode mismatch interrupt mask

