alexeyk13/rexos/drv/stm32/stm32_regsusb.h
/**********  Bit definition for OTG_HS_GENERAL_RXSTSR register  ***************/
#define  OTG_HS_GENERAL_RXSTSR_FRMNUM                        (uint32_t)(0xful << 21ul)  //Device: frame number
#define  OTG_HS_GENERAL_RXSTSR_PKTSTS                        (uint32_t)(0xful << 17ul)  //Packet status
#define  OTG_HS_GENERAL_RXSTSR_DPID                            (uint32_t)(0x3ul << 15ul)  //Data PID
#define  OTG_HS_GENERAL_RXSTSR_BCNT                            (uint32_t)(0x7fful << 4ul) //Bytes count
#define  OTG_HS_GENERAL_RXSTSR_CHNUM                        (uint32_t)(0xful << 0ul)   //Host: Channel number
#define  OTG_HS_GENERAL_RXSTSR_EPNUM                        (uint32_t)(0xful << 0ul)   //Device: EP number

#define  OTG_HS_GENERAL_RXSTSR_FRMNUM_POS                    (uint32_t)(21ul)

#define  OTG_HS_GENERAL_RXSTSR_PKTSTS_OUT_NAK            (uint32_t)(1ul << 17ul)    //Device: global OUT NAK
#define  OTG_HS_GENERAL_RXSTSR_PKTSTS_IN_RX                (uint32_t)(2ul << 17ul)    //Host: IN data packet received
#define  OTG_HS_GENERAL_RXSTSR_PKTSTS_OUT_RX                (uint32_t)(2ul << 17ul)    //Device: OUT data packet received
#define  OTG_HS_GENERAL_RXSTSR_PKTSTS_IN_DONE            (uint32_t)(3ul << 17ul)    //Host: IN transfer complete
#define  OTG_HS_GENERAL_RXSTSR_PKTSTS_OUT_DONE            (uint32_t)(3ul << 17ul)    //Device: OUT transfer complete
#define  OTG_HS_GENERAL_RXSTSR_PKTSTS_DATA_ERROR        (uint32_t)(5ul << 17ul)    //Host: Data toggle error
#define  OTG_HS_GENERAL_RXSTSR_PKTSTS_SETUP_DONE        (uint32_t)(5ul << 17ul)    //Device: SETUP transfer complete
#define  OTG_HS_GENERAL_RXSTSR_PKTSTS_SETUP_RX            (uint32_t)(6ul << 17ul)    //Device: SETUP received
#define  OTG_HS_GENERAL_RXSTSR_PKTSTS_HALTED                (uint32_t)(7ul << 17ul)    //Host: Channel halted

#define  OTG_HS_GENERAL_RXSTSR_DPID_DATA0                    (uint32_t)(0ul << 15ul)    //DATA0
#define  OTG_HS_GENERAL_RXSTSR_DPID_DATA1                    (uint32_t)(2ul << 15ul)    //DATA1
#define  OTG_HS_GENERAL_RXSTSR_DPID_DATA2                    (uint32_t)(1ul << 15ul)    //DATA2
#define  OTG_HS_GENERAL_RXSTSR_DPID_MDATA                    (uint32_t)(3ul << 15ul)    //MDATA

#define  OTG_HS_GENERAL_RXSTSR_BCNT_POS                    (uint32_t)(4ul)
#define  OTG_HS_GENERAL_RXSTSR_CHNUM_POS                    (uint32_t)(0ul)
#define  OTG_HS_GENERAL_RXSTSR_EPNUM_POS                    (uint32_t)(0ul)

/**********  Bit definition for OTG_HS_GENERAL_RXSTSP register  ***************/
#define  OTG_HS_GENERAL_RXSTSP_PKTSTS                        (uint32_t)(0xful << 17ul)  //Packet status
#define  OTG_HS_GENERAL_RXSTSP_DPID                            (uint32_t)(0x3ul << 15ul)  //Data PID
#define  OTG_HS_GENERAL_RXSTSP_BCNT                            (uint32_t)(0x7fful << 4ul) //Bytes count
#define  OTG_HS_GENERAL_RXSTSP_CHNUM                        (uint32_t)(0xful << 0ul)   //Host: Channel number
#define  OTG_HS_GENERAL_RXSTSP_EPNUM                        (uint32_t)(0xful << 0ul)   //Device: EP number

#define  OTG_HS_GENERAL_RXSTSP_PKTSTS_OUT_NAK            (uint32_t)(1ul << 17ul)    //Device: global OUT NAK
#define  OTG_HS_GENERAL_RXSTSP_PKTSTS_IN_RX                (uint32_t)(2ul << 17ul)    //Host: IN data packet received
#define  OTG_HS_GENERAL_RXSTSP_PKTSTS_OUT_RX                (uint32_t)(2ul << 17ul)    //Device: OUT data packet received
#define  OTG_HS_GENERAL_RXSTSP_PKTSTS_IN_DONE            (uint32_t)(3ul << 17ul)    //Host: IN transfer complete
#define  OTG_HS_GENERAL_RXSTSP_PKTSTS_OUT_DONE            (uint32_t)(3ul << 17ul)    //Device: OUT transfer complete
#define  OTG_HS_GENERAL_RXSTSP_PKTSTS_DATA_ERROR        (uint32_t)(5ul << 17ul)    //Host: Data toggle error
#define  OTG_HS_GENERAL_RXSTSP_PKTSTS_SETUP_DONE        (uint32_t)(5ul << 17ul)    //Device: SETUP transfer complete
#define  OTG_HS_GENERAL_RXSTSP_PKTSTS_SETUP_RX            (uint32_t)(6ul << 17ul)    //Device: SETUP received
#define  OTG_HS_GENERAL_RXSTSP_PKTSTS_HALTED                (uint32_t)(7ul << 17ul)    //Host: Channel halted


#define  OTG_HS_GENERAL_RXSTSP_DPID_DATA0                    (uint32_t)(0ul << 15ul)    //DATA0
#define  OTG_HS_GENERAL_RXSTSP_DPID_DATA1                    (uint32_t)(2ul << 15ul)    //DATA1
#define  OTG_HS_GENERAL_RXSTSP_DPID_DATA2                    (uint32_t)(1ul << 15ul)    //DATA2
#define  OTG_HS_GENERAL_RXSTSP_DPID_MDATA                    (uint32_t)(3ul << 15ul)    //MDATA

#define  OTG_HS_GENERAL_RXSTSP_BCNT_POS                    (uint32_t)(4ul)
#define  OTG_HS_GENERAL_RXSTSP_CHNUM_POS                    (uint32_t)(0ul)
#define  OTG_HS_GENERAL_RXSTSP_EPNUM_POS                    (uint32_t)(0ul)

/**********  Bit definition for OTG_HS_GENERAL_RXFSIZ register  ***************/
#define  OTG_HS_GENERAL_RXFSIZ_RXFD                            (uint32_t)(0xfffful << 0ul)  //RxFIFO depth

#define  OTG_HS_GENERAL_RXFSIZ_POS                            (uint32_t)(0ul)

/**********  Bit definition for OTG_HS_GENERAL_NPTXFSIZ register  ***************/
#define  OTG_HS_GENERAL_NPTXFSIZ_NPTXFD                    (uint32_t)(0xfffful << 16ul)  //Nonperiodic TxFIFO depth
#define  OTG_HS_GENERAL_NPTXFSIZ_NPTXFSA                    (uint32_t)(0xfffful << 0ul)   //Nonperiodic trasmit RAM start address

#define  OTG_HS_GENERAL_NPTXFSIZ_NPTXFD_POS                (uint32_t)(16ul)
#define  OTG_HS_GENERAL_NPTXFSIZ_NPTXFSA_POS                (uint32_t)(0ul)

/**********  Bit definition for OTG_HS_GENERAL_TX0FSIZ register  ***************/
#define  OTG_HS_GENERAL_TX0FSIZ_TX0FD                        (uint32_t)(0xfffful << 16ul)  //Endpoint 0 TxFIFO depth
#define  OTG_HS_GENERAL_TX0FSIZ_TX0FSA                        (uint32_t)(0xfffful << 0ul)   //Endpoint 0 RAM start address

#define  OTG_HS_GENERAL_TX0FSIZ_TX0FD_POS                    (uint32_t)(16ul)
#define  OTG_HS_GENERAL_TX0FSIZ_TX0FSA_POS                (uint32_t)(0ul)

/**********  Bit definition for OTG_HS_GENERAL_NPTXSTS register  ***************/
#define  OTG_HS_GENERAL_NPTXSTS_NPTXQTOP                    (uint32_t)(0x7ful << 24ul)   //Top of nonperiodic transmit request queue
#define  OTG_HS_GENERAL_NPTXSTS_NPTQXSAV                    (uint32_t)(0xfful << 16ul)   //Nonperiodic transmit request queue space available
#define  OTG_HS_GENERAL_NPTXSTS_NPTXFSAV                    (uint32_t)(0xfffful << 0ul)  //Nonperiodic TxFIFO space available

#define  OTG_HS_GENERAL_NPTXSTS_NPTXQTOP_POS                (uint32_t)(24ul)
#define  OTG_HS_GENERAL_NPTXSTS_NPTQXSAV_POS                (uint32_t)(16ul)
#define  OTG_HS_GENERAL_NPTXSTS_NPTXFSAV_POS                (uint32_t)(0ul)

