alexeyk13/rexos/drv/stm32/stm32_regsusb.h
/**********  Bit definition for OTG_HS_GENERAL_I2CCTL register  ***************/
#define  OTG_HS_GENERAL_I2CCTL_BSYDNE                        (uint32_t)(1ul << 31ul)     //I2C busy/done
#define  OTG_HS_GENERAL_I2CCTL_RW                            (uint32_t)(1ul << 30ul)     //Read/write indicator
#define  OTG_HS_GENERAL_I2CCTL_I2CDATSE0                    (uint32_t)(1ul << 28ul)     //I2C DatSe0 USB mode
#define  OTG_HS_GENERAL_I2CCTL_I2CDEVADR                    (uint32_t)(3ul << 26ul)     //I2C device address
#define  OTG_HS_GENERAL_I2CCTL_ACK                            (uint32_t)(1ul << 24ul)     //I2C ACK
#define  OTG_HS_GENERAL_I2CCTL_I2CEN                        (uint32_t)(1ul << 23ul)     //I2C enable
#define  OTG_HS_GENERAL_I2CCTL_ADDR                            (uint32_t)(0x7ful << 16ul)  //I2C address
#define  OTG_HS_GENERAL_I2CCTL_REGADDR                        (uint32_t)(0xfffful << 8ul) //I2C register address
#define  OTG_HS_GENERAL_I2CCTL_RWDATA                        (uint32_t)(0xfffful << 0ul) //I2C Read/Write data

#define  OTG_HS_GENERAL_I2CCTL_I2CDEVADR_POS                (uint32_t)(26ul)
#define  OTG_HS_GENERAL_I2CCTL_ADDR_POS                    (uint32_t)(16ul)
#define  OTG_HS_GENERAL_I2CCTL_REGADDR_POS                (uint32_t)(8ul)
#define  OTG_HS_GENERAL_I2CCTL_RWDATA_POS                    (uint32_t)(0ul)

/**********  Bit definition for OTG_HS_GENERAL_CCFG register  ***************/
#define  OTG_HS_GENERAL_CCFG_NOVBUSSENS                    (uint32_t)(1ul << 21ul)     //VBus sensing disable option
#define  OTG_HS_GENERAL_CCFG_SOFOUTEN                        (uint32_t)(1ul << 20ul)     //SOF output enable
#define  OTG_HS_GENERAL_CCFG_VBUSBSEN                        (uint32_t)(1ul << 19ul)     //Enable VBus sensing "B" device
#define  OTG_HS_GENERAL_CCFG_VBUSASEN                        (uint32_t)(1ul << 18ul)     //Enable VBus sensing "A" device
#define  OTG_HS_GENERAL_CCFG_I2CPADEN                        (uint32_t)(1ul << 17ul)     //Enable I2C bus connection for the external I2C PHY interface
#define  OTG_HS_GENERAL_CCFG_PWRDWN                            (uint32_t)(1ul << 16ul)     //Power down

/*************  Bit definition for OTG_HS_GENERAL_CID register  ***************/
#define  OTG_HS_GENERAL_CID_PRODUCT_ID                        (uint32_t)(0xfffffffful << 0ul)//Product ID

#define  OTG_HS_GENERAL_CID_PRODUCT_ID_POS                (uint32_t)(0ul)

/**********  Bit definition for OTG_HS_GENERAL_HPTXFSIZ register  ************/
#define  OTG_HS_GENERAL_HPTXFSIZ_PTXFD                        (uint32_t)(0xfffful << 16ul)//Host periodic TxFIFO depth
#define  OTG_HS_GENERAL_HPTXFSIZ_PTXFSA                    (uint32_t)(0xfffful << 0ul) //Host periodic TxFIFO start address

#define  OTG_HS_GENERAL_HPTXFSIZ_PTXFD_POS                (uint32_t)(16ul)
#define  OTG_HS_GENERAL_HPTXFSIZ_PTXFSA_POS                (uint32_t)(0ul)

/**********  Bit definition for OTG_HS_GENERAL_DIEPTXF register  ************/
#define  OTG_HS_GENERAL_DIEPTXF_INEPTXFD                    (uint32_t)(0xfffful << 16ul)//IN endpoint TxFIFO depth
#define  OTG_HS_GENERAL_DIEPTXF_INEPTXFSA                    (uint32_t)(0xfffful << 0ul) //IN endpoint TxFIFO start address

#define  OTG_HS_GENERAL_DIEPTXF_INEPTXFD_POS                (uint32_t)(16ul)
#define  OTG_HS_GENERAL_DIEPTXF_INEPTXFSA_POS            (uint32_t)(0ul)

/******************************************************************************/
/*                                                                            */
/*                            USB High Speed HOST                             */
/*                                                                            */
/******************************************************************************/
/**************  Bit definition for OTG_HS_HOST_CFG register  *****************/
#define  OTG_HS_HOST_CFG_FSLSS                                (uint32_t)(1ul << 2ul)        //FS- and LS-only support
#define  OTG_HS_HOST_CFG_FSLSSPCS                            (uint32_t)(3ul << 0ul)        //FS/LS PHY clock select

#define  OTG_HS_HOST_CFG_FSLSSPCS_48MHZ                    (uint32_t)(1ul << 0ul)        //PHY clock is running at 48 MHz
#define  OTG_HS_HOST_CFG_FSLSSPCS_6MHZ                        (uint32_t)(2ul << 0ul)        //LS 6 MHz PHY clock frequency

/**************  Bit definition for OTG_HS_HOST_FIR register  *****************/
#define  OTG_HS_HOST_FIR_FRIVL                                (uint32_t)(0xfffful << 0ul) //Frame interval

#define  OTG_HS_HOST_FIR_FRIVL_POS                            (uint32_t)(0ul)

/**************  Bit definition for OTG_HS_HOST_FNUM register  *****************/
#define  OTG_HS_HOST_FNUM_FTREM                                (uint32_t)(0xfffful << 16ul)//Frame time remaining
#define  OTG_HS_HOST_FNUM_FRNUM                                (uint32_t)(0xfffful << 0ul) //Frame number

#define  OTG_HS_HOST_FNUM_FTREM_POS                            (uint32_t)(16ul)
#define  OTG_HS_HOST_FNUM_FRNUM_POS                            (uint32_t)(0ul)

/**************  Bit definition for OTG_HS_HOST_PTXSTS register  ***************/
#define  OTG_HS_HOST_PTXSTS_PTXQTOP                            (uint32_t)(0xfful << 24ul) //Top of the periodic transmit request queue
#define  OTG_HS_HOST_PTXSTS_PTXQSAV                            (uint32_t)(0xfful << 16ul) //Periodic transmit request queue space available
#define  OTG_HS_HOST_PTXSTS_PTXFSAVL                        (uint32_t)(0xfffful << 0ul)//Periodic transmit data FIFO space available

#define  OTG_HS_HOST_PTXSTS_PTXQTOP_ODD                    (uint32_t)(0x1ul << 31ul)   //Odd/Even frame
#define  OTG_HS_HOST_PTXSTS_PTXQTOP_CHANNEL                (uint32_t)(0xful << 27ul)   //Channel number
#define  OTG_HS_HOST_PTXSTS_PTXQTOP_TYPE                    (uint32_t)(0x3ul << 25ul)   //Type
#define  OTG_HS_HOST_PTXSTS_PTXQTOP_TERMINATE            (uint32_t)(0x1ul << 24ul)   //Terminate (last entry for the selected channel/endpoint)

#define  OTG_HS_HOST_PTXSTS_PTXQTOP_CHANNEL_POS            (uint32_t)(27ul)

#define  OTG_HS_HOST_PTXSTS_PTXQTOP_TYPE_IN_OUT            (uint32_t)(0x0ul << 25ul)   //IN/OUT
#define  OTG_HS_HOST_PTXSTS_PTXQTOP_TYPE_IN_ZERO_LENGTH(uint32_t)(0x1ul << 25ul)   //Zero-length packet
#define  OTG_HS_HOST_PTXSTS_PTXQTOP_TYPE_DISABLE        (uint32_t)(0x3ul << 25ul)   //Disable channel command

#define  OTG_HS_HOST_PTXSTS_PTXQSAV_POS                    (uint32_t)(16ul)
#define  OTG_HS_HOST_PTXSTS_PTXFSAVL_POS                    (uint32_t)(0ul)

/**************  Bit definition for OTG_HS_HOST_AINT register  ****************/
#define  OTG_HS_HOST_AINT_HAINT                                (uint32_t)(0xfffful << 0ul) //Channel interrupts

