alexeyk13/rexos/drv/stm32/stm32_regsusb.h
/**********  Bit definition for OTG_HS_HOST_CHANNEL_SPLT register  ***************/
#define  OTG_HS_HOST_CHANNEL_SPLT_SPLTEN                    (uint32_t)(0x1ul << 31ul) //Split enable
#define  OTG_HS_HOST_CHANNEL_SPLT_COMPLSPLT                (uint32_t)(0x1ul << 16ul) //Do complete split
#define  OTG_HS_HOST_CHANNEL_SPLT_XACTPOS                    (uint32_t)(0x3ul << 14ul) //Transaction position
#define  OTG_HS_HOST_CHANNEL_SPLT_HUBADDR                    (uint32_t)(0x7ful << 7ul) //Hub address
#define  OTG_HS_HOST_CHANNEL_SPLT_PORTADDR                (uint32_t)(0x7ful << 0ul) //Port address

#define  OTG_HS_HOST_CHANNEL_SPLT_XACTPOS_ALL            (uint32_t)(0x3ul << 14ul) //All. This is the entire data payload of this transaction (which is less than or equal to 188 bytes)
#define  OTG_HS_HOST_CHANNEL_SPLT_XACTPOS_BEGIN            (uint32_t)(0x2ul << 14ul) //Begin. This is the first data payload of this transaction (which is larger than 188 bytes)
#define  OTG_HS_HOST_CHANNEL_SPLT_XACTPOS_MID            (uint32_t)(0x0ul << 14ul) //Mid. This is the middle payload of this transaction (which is larger than 188 bytes)
#define  OTG_HS_HOST_CHANNEL_SPLT_XACTPOS_END            (uint32_t)(0x1ul << 14ul) //End. This is the last payload of this transaction (which is larger than 188 bytes)

#define  OTG_HS_HOST_CHANNEL_SPLT_HUBADDR_POS            (uint32_t)(7ul)
#define  OTG_HS_HOST_CHANNEL_SPLT_PORTADDR_POS            (uint32_t)(0ul)

/**********  Bit definition for OTG_HS_HOST_CHANNEL_INT register  ****************/
#define  OTG_HS_HOST_CHANNEL_INT_DTERR                        (uint32_t)(0x1ul << 10ul) //Data toggle error
#define  OTG_HS_HOST_CHANNEL_INT_FRMOR                        (uint32_t)(0x1ul << 9ul)  //Frame overrun
#define  OTG_HS_HOST_CHANNEL_INT_BBERR                        (uint32_t)(0x1ul << 8ul)  //Babble error
#define  OTG_HS_HOST_CHANNEL_INT_TXERR                        (uint32_t)(0x1ul << 7ul)  //Transaction error
#define  OTG_HS_HOST_CHANNEL_INT_NYET                        (uint32_t)(0x1ul << 6ul)  //Responce received interrupt
#define  OTG_HS_HOST_CHANNEL_INT_ACK                        (uint32_t)(0x1ul << 5ul)  //ACK response received/transmitted interrupt
#define  OTG_HS_HOST_CHANNEL_INT_NAK                        (uint32_t)(0x1ul << 4ul)  //NAK response received interrupt
#define  OTG_HS_HOST_CHANNEL_INT_STALL                        (uint32_t)(0x1ul << 3ul)  //STALL response received interrupt
#define  OTG_HS_HOST_CHANNEL_INT_AHBERR                    (uint32_t)(0x1ul << 2ul)  //AHB error
#define  OTG_HS_HOST_CHANNEL_INT_CHH                        (uint32_t)(0x1ul << 1ul)  //Channel halted
#define  OTG_HS_HOST_CHANNEL_INT_XFRC                        (uint32_t)(0x1ul << 0ul)  //Transfer completed

/**********  Bit definition for OTG_HS_HOST_CHANNEL_INTMSK register  *************/
#define  OTG_HS_HOST_CHANNEL_INTMSK_DTERRM                (uint32_t)(0x1ul << 10ul) //Data toggle error interrupt mask
#define  OTG_HS_HOST_CHANNEL_INTMSK_FRMORM                (uint32_t)(0x1ul << 9ul)  //Frame overrun interrupt mask
#define  OTG_HS_HOST_CHANNEL_INTMSK_BBERR                    (uint32_t)(0x1ul << 8ul)  //Babble error interrupt mask
#define  OTG_HS_HOST_CHANNEL_INTMSK_TXERRM                (uint32_t)(0x1ul << 7ul)  //Transaction error interrupt mask
#define  OTG_HS_HOST_CHANNEL_INTMSK_NYETM                    (uint32_t)(0x1ul << 6ul)  //Responce received interrupt mask
#define  OTG_HS_HOST_CHANNEL_INTMSK_ACKM                    (uint32_t)(0x1ul << 5ul)  //ACK response received/transmitted interrupt mask
#define  OTG_HS_HOST_CHANNEL_INTMSK_NAKM                    (uint32_t)(0x1ul << 4ul)  //NAK response received interrupt mask
#define  OTG_HS_HOST_CHANNEL_INTMSK_STALLM                (uint32_t)(0x1ul << 3ul)  //STALL response received interrupt mask
#define  OTG_HS_HOST_CHANNEL_INTMSK_AHBERRM                (uint32_t)(0x1ul << 2ul)  //AHB error interrupt mask
#define  OTG_HS_HOST_CHANNEL_INTMSK_CHHM                    (uint32_t)(0x1ul << 1ul)  //Channel halted interrupt mask
#define  OTG_HS_HOST_CHANNEL_INTMSK_XFRCM                    (uint32_t)(0x1ul << 0ul)  //Transfer completed interrupt mask

/**********  Bit definition for OTG_HS_HOST_CHANNEL_TSIZ register  ***************/
#define  OTG_HS_HOST_CHANNEL_TSIZ_DOPING                    (uint32_t)(0x1ul << 31ul) //Do ping
#define  OTG_HS_HOST_CHANNEL_TSIZ_DPID                        (uint32_t)(0x3ul << 29ul) //Data PID
#define  OTG_HS_HOST_CHANNEL_TSIZ_PKTCNT                    (uint32_t)(0x3fful << 19ul)//Packet count
#define  OTG_HS_HOST_CHANNEL_TSIZ_XFRSIZ                    (uint32_t)(0x7fffful << 0ul)//Transfer size

#define  OTG_HS_HOST_CHANNEL_TSIZ_DPID_DATA0                (uint32_t)(0x0ul << 29ul) //DATA0
#define  OTG_HS_HOST_CHANNEL_TSIZ_DPID_DATA2                (uint32_t)(0x1ul << 29ul) //DATA2
#define  OTG_HS_HOST_CHANNEL_TSIZ_DPID_DATA1                (uint32_t)(0x2ul << 29ul) //DATA1
#define  OTG_HS_HOST_CHANNEL_TSIZ_DPID_MDATA_SETUP        (uint32_t)(0x3ul << 29ul) //MDATA (noncontrol)/SETUP (control)

#define  OTG_HS_HOST_CHANNEL_TSIZ_PKTCNT_POS                (uint32_t)(19ul)
#define  OTG_HS_HOST_CHANNEL_TSIZ_XFRSIZ_POS                (uint32_t)(0ul)

/**********  Bit definition for OTG_HS_HOST_CHANNEL_DMA register  ***************/
#define  OTG_HS_HOST_CHANNEL_DMA_DMAADDR                    (uint32_t)(0xfffffffful << 0ul)//DMA address

#define  OTG_HS_HOST_CHANNEL_DMA_DMAADDR_POS                (uint32_t)(0ul)

/******************************************************************************/
/*                                                                            */
/*                            USB High Speed DEVICE                           */
/*                                                                            */
/******************************************************************************/
/**************  Bit definition for OTG_HS_DEVICE_CFG register  ***************/
#define  OTG_HS_DEVICE_CFG_PERSCHIVL                        (uint32_t)(3ul << 25ul)      //Periodic scheduling interval
#define  OTG_HS_DEVICE_CFG_PFIVL                                (uint32_t)(3ul << 11ul)      //Periodic frame interval
#define  OTG_HS_DEVICE_CFG_DAD                                (uint32_t)(0x7ful << 4ul)      //Device address
#define  OTG_HS_DEVICE_CFG_NZLSOHSK                            (uint32_t)(1ul << 1ul)      //Non-zero length status OUT handshake
#define  OTG_HS_DEVICE_CFG_DSPD                                (uint32_t)(3ul << 0ul)      //Device speed

#define  OTG_HS_DEVICE_CFG_PERSCHIVL_25                    (uint32_t)(0ul << 25ul)      //25% of micro(frame)
#define  OTG_HS_DEVICE_CFG_PERSCHIVL_50                    (uint32_t)(1ul << 25ul)      //50% of micro(frame)
#define  OTG_HS_DEVICE_CFG_PERSCHIVL_75                    (uint32_t)(2ul << 25ul)      //75% of micro(frame)

