alexeyk13/rexos/drv/stm32/stm32_regsusb.h
/************  Bit definition for OTG_HS_DEVICE_ENDPOINT_DMA register  *************/
#define  OTG_HS_DEVICE_ENDPOINT_DMA_DMAADDR                (uint32_t)(0xfffffffful << 0ul)//DMA address

#define  OTG_HS_DEVICE_ENDPOINT_DMA_DMAADDR_POS            (uint32_t)(0ul)

/************  Bit definition for OTG_HS_DEVICE_ENDPOINT_FSTS register  *************/
#define  OTG_HS_DEVICE_ENDPOINT_FSTS_INEPTFSAV            (uint32_t)(0xfffful << 0ul)    //IN EP TxFIFO space available

#define  OTG_HS_DEVICE_ENDPOINT_FSTS_INEPTFSAV_POS        (uint32_t)(0ul)

/******************************************************************************/
/*                                                                            */
/*                            USB High Speed POWER & CLOCK                    */
/*                                                                            */
/******************************************************************************/
/************  Bit definition for OTG_HS_PC_GCCTL register  *******************/
#define  OTG_HS_PC_GCCTL_PHYSUSP                                (uint32_t)(1ul << 4ul) //phy suspended
#define  OTG_HS_PC_GCCTL_GATEHCLK                            (uint32_t)(1ul << 1ul) //Gate HCLK
#define  OTG_HS_PC_GCCTL_STPPCLK                                (uint32_t)(1ul << 0ul) //Stop PHY clock

/******************************************************************************/
/*                                                                            */
/*                            OTG Full Speed                                  */
/*                                                                            */
/******************************************************************************/

typedef struct {
    __IO uint32_t OTGCTL;       //0x00 Control and status register
    __IO uint32_t OTGINT;       //0x04 Interrupt register
    __IO uint32_t AHBCFG;       //0x08 AHB configuration register
    __IO uint32_t USBCFG;       //0x0c USB configuration register
    __IO uint32_t RSTCTL;       //0x10 Reset register
    __IO uint32_t INTSTS;       //0x14 Core interrupt register
    __IO uint32_t INTMSK;       //0x18 Interrupt mask register
    __I  uint32_t RXSTSR;       //0x1c Receive status debug read/ORG status read register
    __IO uint32_t RXSTSP;       //0x20 Receive status debug pop/ORG status pop register
    __IO uint32_t RXFSIZ;       //0x24 Receive FIFO size register
    __IO uint32_t TX0FSIZ;      //0x28 Host: Nonperiodic transmit FIFO size, device: EP0 transmit FIFO size register
    __I  uint32_t NPTXSTS;      //0x2c Host only: Nonperiodic transmit FIFO/queue status register
    __IO uint32_t RESERVED1;    //0x30
    __I  uint32_t RESERVED2;    //0x34
    __IO uint32_t CCFG;         //0x38 Core configuration register
    __IO uint32_t CID;          //0x3c Core ID register
    __I  uint32_t RESERVED3[48];//0x40..0xfc
    __IO uint32_t HPTXFSIZ;     //0x100 Host periodic transmit FIFO size register
    __IO uint32_t DIEPTXF[3];   //0x104 + (n *4) device IN endpoint transmit FIFO size register
} OTG_FS_GENERAL_TypeDef;

typedef struct {
    __IO uint32_t CHAR;            //+0x00 characteristics register
    __IO uint32_t RESERVED1;    //+0x04
    __IO uint32_t INT;            //+0x08 interrupt register
    __IO uint32_t INTMSK;        //+0x0c interrupt mask register
    __IO uint32_t HCTSIZ;        //+0x10 transfer size register
    __I  uint32_t RESERVED2[3];    //+0x14..0x1c
} OTG_FS_HOST_CHANNEL_TypeDef;

typedef struct {
    __IO uint32_t CFG;            //0x400 configuration register
    __IO uint32_t FIR;            //0x404 frame interval register
    __IO uint32_t FNUM;            //0x408 frame number/frame time remaining register
    __I  uint32_t RESERVED;        //0x40c
    __IO uint32_t PTXSTS;        //0x410 periodic transmit FIFO/queue status register
    __IO uint32_t AINT;            //0x414 all channels interrupt register
    __IO uint32_t AINTMSK;        //0x418 all channels interrupt mask register
    __I  uint32_t RESERVED1[9];//0x41c..0x43c
    __IO uint32_t PRT;            //0x440 port control and status register
    __IO uint32_t RESERVED2[47];//0x444..0x4fc
    OTG_FS_HOST_CHANNEL_TypeDef CHANNEL[12];//0x500 0x20 * 12 channel control
} OTG_FS_HOST_TypeDef;

typedef struct {
    __IO uint32_t CTL;          //+0x00 control register
    __I  uint32_t RESERVED;     //+0x04
    __IO uint32_t INT;          //+0x08 interrupt register
    __I  uint32_t RESERVED1;    //+0x0c
    __IO uint32_t TSIZ;         //+0x10 transfer size register
    __IO uint32_t RESERVED2;    //+0x14
    __IO uint32_t FSTS;         //+0x18 IN endpoint TxFIFO status register
    __I  uint32_t RESERVED3;    //+0x1c
} OTG_FS_DEVICE_ENDPOINT_TypeDef;

typedef struct {
    __IO uint32_t CFG;            //0x800 device configuration register
    __IO uint32_t CTL;            //0x804 device control register
    __IO uint32_t STS;            //0x808 device status register
    __I  uint32_t RESERVED;        //0x80c
    __IO uint32_t IEPMSK;        //0x810 device IN endpoint common interrupt mask register
    __IO uint32_t OEPMSK;        //0x814 device OUT endpoint common interrupt mask register
    __IO uint32_t AINT;            //0x818 all endpoints interrupt register
    __IO uint32_t AINTMSK;        //0x81c all endpoints interrupt mask register
    __I  uint32_t RESERVED1[2]; //0x820..0x824
    __IO uint32_t VBUSDIS;        //0x828 VBUS discharge time register
    __IO uint32_t VBUSPULSE;    //0x82c VBUS pulsing time register
    __IO uint32_t RESERVED2;    //0x830
    __IO uint32_t EIPEMPMSK;    //0x834 IN endpoint FIFO empty interrupt mask register
    __I  uint32_t RESERVED3[50];//0x838..0x8fc
    OTG_FS_DEVICE_ENDPOINT_TypeDef INEP[16];//0x900.. 0xafc IN EP configs
    OTG_FS_DEVICE_ENDPOINT_TypeDef OUTEP[16];//0xB00.. 0xcfc OUT EP configs
} OTG_FS_DEVICE_TypeDef;

typedef struct {
    __IO uint32_t GCCTL;        //0xE00 power and clock gating control register
} OTG_FS_PC_TypeDef;

