alexeyk13/rexos/drv/stm32/stm32_regsusb.h
#define OTG_FS_BASE                                             0x50000000
#define OTG_FS_GENERAL_BASE                                     (OTG_FS_BASE + 0x0000)
#define OTG_FS_HOST_BASE                                        (OTG_FS_BASE + 0x0400)
#define OTG_FS_DEVICE_BASE                                      (OTG_FS_BASE + 0x0800)
#define OTG_FS_PC_BASE                                          (OTG_FS_BASE + 0x0e00)
#define OTG_FS_FIFO_BASE                                        (OTG_FS_BASE + 0x1000)

#define OTG_FS_GENERAL                                          ((OTG_FS_GENERAL_TypeDef *) OTG_FS_GENERAL_BASE)
#define OTG_FS_HOST                                             ((OTG_FS_HOST_TypeDef *) OTG_FS_HOST_BASE)
#define OTG_FS_DEVICE                                           ((OTG_FS_DEVICE_TypeDef *) OTG_FS_DEVICE_BASE)
#define OTG_FS_PC                                               ((OTG_FS_PC_TypeDef *) OTG_FS_PC_BASE)

/******************************************************************************/
/*                         Peripheral Registers_Bits_Definition               */
/******************************************************************************/

/******************************************************************************/
/*                                                                            */
/*                            OTG Full Speed GENERAL                          */
/*                                                                            */
/******************************************************************************/
/**********  Bit definition for OTG_FS_GENERAL_OTGCTL register  ***************/
#define  OTG_FS_GENERAL_OTGCTL_BSVLD                            (uint32_t)(1ul << 19ul) //B-session valid
#define  OTG_FS_GENERAL_OTGCTL_ASVLD                            (uint32_t)(1ul << 18ul) //A-session valid
#define  OTG_FS_GENERAL_OTGCTL_DBCT                             (uint32_t)(1ul << 17ul) //Long/short debounce time
#define  OTG_FS_GENERAL_OTGCTL_CITST                            (uint32_t)(1ul << 16ul) //Connector ID status
#define  OTG_FS_GENERAL_OTGCTL_DHNPEN                           (uint32_t)(1ul << 11ul) //Device HNP enabled
#define  OTG_FS_GENERAL_OTGCTL_HSHNPEN                          (uint32_t)(1ul << 10ul) //Host set HNP enabled
#define  OTG_FS_GENERAL_OTGCTL_HNPRQ                            (uint32_t)(1ul << 9ul)  //HNP request
#define  OTG_FS_GENERAL_OTGCTL_HNGSCS                           (uint32_t)(1ul << 8ul)  //Host negotiations success
#define  OTG_FS_GENERAL_OTGCTL_SRQ                              (uint32_t)(1ul << 1ul)  //Session request
#define  OTG_FS_GENERAL_OTGCTL_SRQSCS                           (uint32_t)(1ul << 0ul)  //Session request success

/**********  Bit definition for OTG_FS_GENERAL_OTGINT register  ***************/
#define  OTG_FS_GENERAL_OTGINT_DBCDNE                           (uint32_t)(1ul << 19ul) //Debounce done
#define  OTG_FS_GENERAL_OTGINT_ADTOCHG                          (uint32_t)(1ul << 18ul) //A-device timeout change
#define  OTG_FS_GENERAL_OTGINT_HNGDET                           (uint32_t)(1ul << 17ul) //Host negotiation detected
#define  OTG_FS_GENERAL_OTGINT_HNSSCHG                          (uint32_t)(1ul << 9ul)  //Host negotiation success status change
#define  OTG_FS_GENERAL_OTGINT_SRSSCHG                          (uint32_t)(1ul << 8ul)  //Session request success status change
#define  OTG_FS_GENERAL_OTGINT_SEDET                            (uint32_t)(1ul << 2ul)  //Session end detected

/**********  Bit definition for OTG_FS_GENERAL_AHBCFG register  ***************/
#define  OTG_FS_GENERAL_AHBCFG_PTXFELVL                         (uint32_t)(1ul << 8ul)  //Periodic TxFIFO empty level
#define  OTG_FS_GENERAL_AHBCFG_TXFELVL                          (uint32_t)(1ul << 7ul)  //TxFIFO empty level
#define  OTG_FS_GENERAL_AHBCFG_GINT                             (uint32_t)(1ul << 0ul)  //Global interrupt mask

/**********  Bit definition for OTG_FS_GENERAL_USBCFG register  ***************/
#define  OTG_FS_GENERAL_USBCFG_CTXPKT                           (uint32_t)(1ul << 31ul) //Corrupt Tx packet
#define  OTG_FS_GENERAL_USBCFG_FDMOD                            (uint32_t)(1ul << 30ul) //Forced peripheral mode
#define  OTG_FS_GENERAL_USBCFG_FHMOD                            (uint32_t)(1ul << 29ul) //Forced host mode
#define  OTG_FS_GENERAL_USBCFG_TRDT                             (uint32_t)(0xful << 10ul)//USB turn around time
#define  OTG_FS_GENERAL_USBCFG_HNPCAP                           (uint32_t)(1ul << 9ul)  //HNP-capable
#define  OTG_FS_GENERAL_USBCFG_SRPCAP                           (uint32_t)(1ul << 8ul)  //SRP-capable
#define  OTG_FS_GENERAL_USBCFG_PHYSEL                           (uint32_t)(1ul << 6ul)  //USB 2.0 high-speed ULPI PHY or USB 1.1 full speed serial tranceiver
#define  OTG_FS_GENERAL_USBCFG_TOCAL                            (uint32_t)(7ul << 0ul)  //FS timeout calibration

#define  OTG_FS_GENERAL_USBCFG_TRDT_POS                         (uint32_t)(10ul)
#define  OTG_FS_GENERAL_USBCFG_TOCAL_POS                        (uint32_t)(0ul)

/**********  Bit definition for OTG_FS_GENERAL_RSTCTL register  ***************/
#define  OTG_FS_GENERAL_RSTCTL_AHBIDL                           (uint32_t)(1ul << 31ul)  //AHB master idle
#define  OTG_FS_GENERAL_RSTCTL_TXFNUM                           (uint32_t)(0x1ful << 6ul)//TxFIFO number
#define  OTG_FS_GENERAL_RSTCTL_TXFFLSH                          (uint32_t)(1ul << 5ul)   //TxFIFO flush
#define  OTG_FS_GENERAL_RSTCTL_RXFFLSH                          (uint32_t)(1ul << 4ul)   //RxFIFO flush
#define  OTG_FS_GENERAL_RSTCTL_FCRST                            (uint32_t)(1ul << 2ul)   //Host frame counter reset
#define  OTG_FS_GENERAL_RSTCTL_HSRST                            (uint32_t)(1ul << 1ul)   //HCLK soft reset
#define  OTG_FS_GENERAL_RSTCTL_CSRST                            (uint32_t)(1ul << 0ul)   //CORE soft reset

#define  OTG_FS_GENERAL_RSTCTL_TXFNUM_POS                       (uint32_t)(6ul)

/**********  Bit definition for OTG_FS_GENERAL_INTSTS register  ***************/
#define  OTG_FS_GENERAL_INTSTS_WKUPINT                          (uint32_t)(1ul << 31ul)  //Resume/remote wakeup detected interrupt
#define  OTG_FS_GENERAL_INTSTS_SRQINT                           (uint32_t)(1ul << 30ul)  //Session request/new session detected interrupt
#define  OTG_FS_GENERAL_INTSTS_DISCINT                          (uint32_t)(1ul << 29ul)  //Disconnect detected interrupt
#define  OTG_FS_GENERAL_INTSTS_CIDSCHG                          (uint32_t)(1ul << 28ul)  //Connector ID status change
#define  OTG_FS_GENERAL_INTSTS_PTXFE                            (uint32_t)(1ul << 26ul)  //Periodic TxFIFO empty
#define  OTG_FS_GENERAL_INTSTS_HCINT                            (uint32_t)(1ul << 25ul)  //Host channel interrupt
#define  OTG_FS_GENERAL_INTSTS_HPRTINT                          (uint32_t)(1ul << 24ul)  //Host port interrupt
#define  OTG_FS_GENERAL_INTSTS_IPXFR                            (uint32_t)(1ul << 21ul)  //Host: incomplete periodic transfer
#define  OTG_FS_GENERAL_INTSTS_INCOMPISOOUT                     (uint32_t)(1ul << 21ul)  //Device: incomplete isochronous OUT transfer
#define  OTG_FS_GENERAL_INTSTS_ISOIXFR                          (uint32_t)(1ul << 20ul)  //Incomplete isochronous transfer
#define  OTG_FS_GENERAL_INTSTS_OEPINT                           (uint32_t)(1ul << 19ul)  //OUT endpoint interrupt
#define  OTG_FS_GENERAL_INTSTS_IEPINT                           (uint32_t)(1ul << 18ul)  //IN endpoint interrupt
#define  OTG_FS_GENERAL_INTSTS_EOPF                             (uint32_t)(1ul << 15ul)  //End of periodic frame interrupt
#define  OTG_FS_GENERAL_INTSTS_ISOODRP                          (uint32_t)(1ul << 14ul)  //Isochronous OUT packet dropped interrupt
#define  OTG_FS_GENERAL_INTSTS_ENUMDNE                          (uint32_t)(1ul << 13ul)  //Enumeration done interrupt
#define  OTG_FS_GENERAL_INTSTS_USBRST                           (uint32_t)(1ul << 12ul)  //USB reset
#define  OTG_FS_GENERAL_INTSTS_USBSUSP                          (uint32_t)(1ul << 11ul)  //USB suspend
#define  OTG_FS_GENERAL_INTSTS_ESUSP                            (uint32_t)(1ul << 10ul)  //Early suspend
#define  OTG_FS_GENERAL_INTSTS_GONAKEFF                         (uint32_t)(1ul << 7ul)   //Global OUT NAK effective
#define  OTG_FS_GENERAL_INTSTS_GINAKEFF                         (uint32_t)(1ul << 6ul)   //Global OUT nonperiodic NAK effective
#define  OTG_FS_GENERAL_INTSTS_NPTXFE                           (uint32_t)(1ul << 5ul)   //Nonperiodic TxFIFO empty
#define  OTG_FS_GENERAL_INTSTS_RXFLVL                           (uint32_t)(1ul << 4ul)   //RxFIFO nonempty
#define  OTG_FS_GENERAL_INTSTS_SOF                              (uint32_t)(1ul << 3ul)   //Start of frame
#define  OTG_FS_GENERAL_INTSTS_OTGINT                           (uint32_t)(1ul << 2ul)   //OTG interrupt
#define  OTG_FS_GENERAL_INTSTS_MMIS                             (uint32_t)(1ul << 1ul)   //Mode mismatch interrupt
#define  OTG_FS_GENERAL_INTSTS_CMOD                             (uint32_t)(1ul << 0ul)   //Current mode operation

