alexeyk13/rexos/drv/stm32/stm32_regsusb.h
/**********  Bit definition for OTG_FS_GENERAL_INTMSK register  ***************/
#define  OTG_FS_GENERAL_INTMSK_WKUPM                            (uint32_t)(1ul << 31ul)  //Resume/remote wakeup detected interrupt mask
#define  OTG_FS_GENERAL_INTMSK_SRQM                             (uint32_t)(1ul << 30ul)  //Session request/new session detected interrupt mask
#define  OTG_FS_GENERAL_INTMSK_DISCM                            (uint32_t)(1ul << 29ul)  //Disconnect detected interrupt mask
#define  OTG_FS_GENERAL_INTMSK_CIDSCHGM                         (uint32_t)(1ul << 28ul)  //Connector ID status change mask
#define  OTG_FS_GENERAL_INTMSK_PTXFEM                           (uint32_t)(1ul << 26ul)  //Periodic TxFIFO empty mask
#define  OTG_FS_GENERAL_INTMSK_HCM                              (uint32_t)(1ul << 25ul)  //Host channel interrupt mask
#define  OTG_FS_GENERAL_INTMSK_HPRTM                            (uint32_t)(1ul << 24ul)  //Host port interrupt mask
#define  OTG_FS_GENERAL_INTMSK_IPXFRM                           (uint32_t)(1ul << 21ul)  //Host: incomplete periodic transfer mask
#define  OTG_FS_GENERAL_INTMSK_INCOMPISOOUTM                    (uint32_t)(1ul << 21ul)  //Device: incomplete isochronous OUT transfer mask
#define  OTG_FS_GENERAL_INTMSK_ISOIXFRM                         (uint32_t)(1ul << 20ul)  //Incomplete isochronous transfer mask
#define  OTG_FS_GENERAL_INTMSK_OEPM                             (uint32_t)(1ul << 19ul)  //OUT endpoint interrupt mask
#define  OTG_FS_GENERAL_INTMSK_IEPM                             (uint32_t)(1ul << 18ul)  //IN endpoint interrupt mask
#define  OTG_FS_GENERAL_INTMSK_EPMISM                           (uint32_t)(1ul << 17ul)  //Endpoint mismatch interrupt mask
#define  OTG_FS_GENERAL_INTMSK_EOPFM                            (uint32_t)(1ul << 15ul)  //End of periodic frame interrupt mask
#define  OTG_FS_GENERAL_INTMSK_ISOODRPM                         (uint32_t)(1ul << 14ul)  //Isochronous OUT packet dropped interrupt mask
#define  OTG_FS_GENERAL_INTMSK_ENUMDNEM                         (uint32_t)(1ul << 13ul)  //Enumeration done interrupt mask
#define  OTG_FS_GENERAL_INTMSK_USBRSTM                          (uint32_t)(1ul << 12ul)  //USB reset mask
#define  OTG_FS_GENERAL_INTMSK_USBSUSPM                         (uint32_t)(1ul << 11ul)  //USB suspend mask
#define  OTG_FS_GENERAL_INTMSK_ESUSPM                           (uint32_t)(1ul << 10ul)  //Early suspend mask
#define  OTG_FS_GENERAL_INTMSK_GONAKEFFM                        (uint32_t)(1ul << 7ul)   //Global OUT NAK effective mask
#define  OTG_FS_GENERAL_INTMSK_GINAKEFFM                        (uint32_t)(1ul << 6ul)   //Global OUT nonperiodic NAK effective mask
#define  OTG_FS_GENERAL_INTMSK_NPTXFEM                          (uint32_t)(1ul << 5ul)   //Nonperiodic TxFIFO empty mask
#define  OTG_FS_GENERAL_INTMSK_RXFLVLM                          (uint32_t)(1ul << 4ul)   //RxFIFO nonempty mask
#define  OTG_FS_GENERAL_INTMSK_SOFM                             (uint32_t)(1ul << 3ul)   //Start of frame mask
#define  OTG_FS_GENERAL_INTMSK_OTGM                             (uint32_t)(1ul << 2ul)   //OTG interrupt mask
#define  OTG_FS_GENERAL_INTMSK_MMISM                            (uint32_t)(1ul << 1ul)   //Mode mismatch interrupt mask

/**********  Bit definition for OTG_FS_GENERAL_RXSTSR register  ***************/
#define  OTG_FS_GENERAL_RXSTSR_PKTSTS                           (uint32_t)(0xful << 17ul)  //Packet status
#define  OTG_FS_GENERAL_RXSTSR_DPID                             (uint32_t)(0x3ul << 15ul)  //Data PID
#define  OTG_FS_GENERAL_RXSTSR_BCNT                             (uint32_t)(0x7fful << 4ul) //Bytes count
#define  OTG_FS_GENERAL_RXSTSR_CHNUM                            (uint32_t)(0xful << 0ul)   //Host: Channel number
#define  OTG_FS_GENERAL_RXSTSR_EPNUM                            (uint32_t)(0xful << 0ul)   //Device: EP number

#define  OTG_FS_GENERAL_RXSTSR_FRMNUM_POS                       (uint32_t)(21ul)

#define  OTG_FS_GENERAL_RXSTSR_PKTSTS_OUT_NAK                   (uint32_t)(1ul << 17ul)    //Device: global OUT NAK
#define  OTG_FS_GENERAL_RXSTSR_PKTSTS_IN_RX                     (uint32_t)(2ul << 17ul)    //Host: IN data packet received
#define  OTG_FS_GENERAL_RXSTSR_PKTSTS_OUT_RX                    (uint32_t)(2ul << 17ul)    //Device: OUT data packet received
#define  OTG_FS_GENERAL_RXSTSR_PKTSTS_IN_DONE                   (uint32_t)(3ul << 17ul)    //Host: IN transfer complete
#define  OTG_FS_GENERAL_RXSTSR_PKTSTS_OUT_DONE                  (uint32_t)(3ul << 17ul)    //Device: OUT transfer complete
#define  OTG_FS_GENERAL_RXSTSR_PKTSTS_DATA_ERROR                (uint32_t)(5ul << 17ul)    //Host: Data toggle error
#define  OTG_FS_GENERAL_RXSTSR_PKTSTS_SETUP_DONE                (uint32_t)(5ul << 17ul)    //Device: SETUP transfer complete
#define  OTG_FS_GENERAL_RXSTSR_PKTSTS_SETUP_RX                  (uint32_t)(6ul << 17ul)    //Device: SETUP received
#define  OTG_FS_GENERAL_RXSTSR_PKTSTS_HALTED                    (uint32_t)(7ul << 17ul)    //Host: Channel halted

#define  OTG_FS_GENERAL_RXSTSR_DPID_DATA0                       (uint32_t)(0ul << 15ul)    //DATA0
#define  OTG_FS_GENERAL_RXSTSR_DPID_DATA1                       (uint32_t)(2ul << 15ul)    //DATA1
#define  OTG_FS_GENERAL_RXSTSR_DPID_DATA2                       (uint32_t)(1ul << 15ul)    //DATA2
#define  OTG_FS_GENERAL_RXSTSR_DPID_MDATA                       (uint32_t)(3ul << 15ul)    //MDATA

#define  OTG_FS_GENERAL_RXSTSR_BCNT_POS                         (uint32_t)(4ul)
#define  OTG_FS_GENERAL_RXSTSR_CHNUM_POS                        (uint32_t)(0ul)
#define  OTG_FS_GENERAL_RXSTSR_EPNUM_POS                        (uint32_t)(0ul)

/**********  Bit definition for OTG_FS_GENERAL_RXSTSP register  ***************/
#define  OTG_FS_GENERAL_RXSTSP_PKTSTS                           (uint32_t)(0xful << 17ul)  //Packet status
#define  OTG_FS_GENERAL_RXSTSP_DPID                             (uint32_t)(0x3ul << 15ul)  //Data PID
#define  OTG_FS_GENERAL_RXSTSP_BCNT                             (uint32_t)(0x7fful << 4ul) //Bytes count
#define  OTG_FS_GENERAL_RXSTSP_CHNUM                            (uint32_t)(0xful << 0ul)   //Host: Channel number
#define  OTG_FS_GENERAL_RXSTSP_EPNUM                            (uint32_t)(0xful << 0ul)   //Device: EP number

#define  OTG_FS_GENERAL_RXSTSP_PKTSTS_OUT_NAK                   (uint32_t)(1ul << 17ul)    //Device: global OUT NAK
#define  OTG_FS_GENERAL_RXSTSP_PKTSTS_IN_RX                     (uint32_t)(2ul << 17ul)    //Host: IN data packet received
#define  OTG_FS_GENERAL_RXSTSP_PKTSTS_OUT_RX                    (uint32_t)(2ul << 17ul)    //Device: OUT data packet received
#define  OTG_FS_GENERAL_RXSTSP_PKTSTS_IN_DONE                   (uint32_t)(3ul << 17ul)    //Host: IN transfer complete
#define  OTG_FS_GENERAL_RXSTSP_PKTSTS_OUT_DONE                  (uint32_t)(3ul << 17ul)    //Device: OUT transfer complete
#define  OTG_FS_GENERAL_RXSTSP_PKTSTS_DATA_ERROR                (uint32_t)(5ul << 17ul)    //Host: Data toggle error
#define  OTG_FS_GENERAL_RXSTSP_PKTSTS_SETUP_DONE                (uint32_t)(5ul << 17ul)    //Device: SETUP transfer complete
#define  OTG_FS_GENERAL_RXSTSP_PKTSTS_SETUP_RX                  (uint32_t)(6ul << 17ul)    //Device: SETUP received
#define  OTG_FS_GENERAL_RXSTSP_PKTSTS_HALTED                    (uint32_t)(7ul << 17ul)    //Host: Channel halted


#define  OTG_FS_GENERAL_RXSTSP_DPID_DATA0                       (uint32_t)(0ul << 15ul)    //DATA0
#define  OTG_FS_GENERAL_RXSTSP_DPID_DATA1                       (uint32_t)(2ul << 15ul)    //DATA1
#define  OTG_FS_GENERAL_RXSTSP_DPID_DATA2                       (uint32_t)(1ul << 15ul)    //DATA2
#define  OTG_FS_GENERAL_RXSTSP_DPID_MDATA                       (uint32_t)(3ul << 15ul)    //MDATA

#define  OTG_FS_GENERAL_RXSTSP_BCNT_POS                         (uint32_t)(4ul)
#define  OTG_FS_GENERAL_RXSTSP_CHNUM_POS                        (uint32_t)(0ul)
#define  OTG_FS_GENERAL_RXSTSP_EPNUM_POS                        (uint32_t)(0ul)

/**********  Bit definition for OTG_FS_GENERAL_RXFSIZ register  ***************/
#define  OTG_FS_GENERAL_RXFSIZ_RXFD                             (uint32_t)(0xfffful << 0ul)  //RxFIFO depth

#define  OTG_FS_GENERAL_RXFSIZ_POS                              (uint32_t)(0ul)

/**********  Bit definition for OTG_FS_GENERAL_NPTXFSIZ register  ***************/
#define  OTG_FS_GENERAL_NPTXFSIZ_NPTXFD                         (uint32_t)(0xfffful << 16ul)  //Nonperiodic TxFIFO depth
#define  OTG_FS_GENERAL_NPTXFSIZ_NPTXFSA                        (uint32_t)(0xfffful << 0ul)   //Nonperiodic trasmit RAM start address

#define  OTG_FS_GENERAL_NPTXFSIZ_NPTXFD_POS                     (uint32_t)(16ul)
#define  OTG_FS_GENERAL_NPTXFSIZ_NPTXFSA_POS                    (uint32_t)(0ul)

