alexeyk13/rexos/drv/stm32/stm32_regsusb.h
/**********  Bit definition for OTG_FS_GENERAL_TX0FSIZ register  ***************/
#define  OTG_FS_GENERAL_TX0FSIZ_TX0FD                           (uint32_t)(0xfffful << 16ul)  //Endpoint 0 TxFIFO depth
#define  OTG_FS_GENERAL_TX0FSIZ_TX0FSA                          (uint32_t)(0xfffful << 0ul)   //Endpoint 0 RAM start address

#define  OTG_FS_GENERAL_TX0FSIZ_TX0FD_POS                       (uint32_t)(16ul)
#define  OTG_FS_GENERAL_TX0FSIZ_TX0FSA_POS                      (uint32_t)(0ul)

/**********  Bit definition for OTG_FS_GENERAL_NPTXSTS register  ***************/
#define  OTG_FS_GENERAL_NPTXSTS_NPTXQTOP                        (uint32_t)(0x7ful << 24ul)   //Top of nonperiodic transmit request queue
#define  OTG_FS_GENERAL_NPTXSTS_NPTQXSAV                        (uint32_t)(0xfful << 16ul)   //Nonperiodic transmit request queue space available
#define  OTG_FS_GENERAL_NPTXSTS_NPTXFSAV                        (uint32_t)(0xfffful << 0ul)  //Nonperiodic TxFIFO space available

#define  OTG_FS_GENERAL_NPTXSTS_NPTXQTOP_POS                    (uint32_t)(24ul)
#define  OTG_FS_GENERAL_NPTXSTS_NPTQXSAV_POS                    (uint32_t)(16ul)
#define  OTG_FS_GENERAL_NPTXSTS_NPTXFSAV_POS                    (uint32_t)(0ul)

/**********  Bit definition for OTG_FS_GENERAL_CCFG register  ***************/
#define  OTG_FS_GENERAL_CCFG_SOFOUTEN                           (uint32_t)(1ul << 20ul)     //SOF output enable
#define  OTG_FS_GENERAL_CCFG_VBUSBSEN                           (uint32_t)(1ul << 19ul)     //Enable VBus sensing "B" device
#define  OTG_FS_GENERAL_CCFG_VBUSASEN                           (uint32_t)(1ul << 18ul)     //Enable VBus sensing "A" device
#define  OTG_FS_GENERAL_CCFG_PWRDWN                             (uint32_t)(1ul << 16ul)     //Power down

/*************  Bit definition for OTG_FS_GENERAL_CID register  ***************/
#define  OTG_FS_GENERAL_CID_PRODUCT_ID                          (uint32_t)(0xfffffffful << 0ul)//Product ID

#define  OTG_FS_GENERAL_CID_PRODUCT_ID_POS                      (uint32_t)(0ul)

/**********  Bit definition for OTG_FS_GENERAL_HPTXFSIZ register  ************/
#define  OTG_FS_GENERAL_HPTXFSIZ_PTXFD                           (uint32_t)(0xfffful << 16ul)//Host periodic TxFIFO depth
#define  OTG_FS_GENERAL_HPTXFSIZ_PTXFSA                          (uint32_t)(0xfffful << 0ul) //Host periodic TxFIFO start address

#define  OTG_FS_GENERAL_HPTXFSIZ_PTXFD_POS                       (uint32_t)(16ul)
#define  OTG_FS_GENERAL_HPTXFSIZ_PTXFSA_POS                      (uint32_t)(0ul)

/**********  Bit definition for OTG_FS_GENERAL_DIEPTXF register  ************/
#define  OTG_FS_GENERAL_DIEPTXF_INEPTXFD                         (uint32_t)(0xfffful << 16ul)//IN endpoint TxFIFO depth
#define  OTG_FS_GENERAL_DIEPTXF_INEPTXFSA                        (uint32_t)(0xfffful << 0ul) //IN endpoint TxFIFO start address

#define  OTG_FS_GENERAL_DIEPTXF_INEPTXFD_POS                     (uint32_t)(16ul)
#define  OTG_FS_GENERAL_DIEPTXF_INEPTXFSA_POS                    (uint32_t)(0ul)

/******************************************************************************/
/*                                                                            */
/*                            USB Full Speed HOST                             */
/*                                                                            */
/******************************************************************************/
/**************  Bit definition for OTG_FS_HOST_CFG register  *****************/
#define  OTG_FS_HOST_CFG_FSLSS                                   (uint32_t)(1ul << 2ul)        //FS- and LS-only support
#define  OTG_FS_HOST_CFG_FSLSSPCS                                (uint32_t)(3ul << 0ul)        //FS/LS PHY clock select

#define  OTG_FS_HOST_CFG_FSLSSPCS_48MHZ                          (uint32_t)(1ul << 0ul)        //PHY clock is running at 48 MHz
#define  OTG_FS_HOST_CFG_FSLSSPCS_6MHZ                           (uint32_t)(2ul << 0ul)        //LS 6 MHz PHY clock frequency

/**************  Bit definition for OTG_FS_HOST_FIR register  *****************/
#define  OTG_FS_HOST_FIR_FRIVL                                   (uint32_t)(0xfffful << 0ul) //Frame interval

#define  OTG_FS_HOST_FIR_FRIVL_POS                               (uint32_t)(0ul)

/**************  Bit definition for OTG_FS_HOST_FNUM register  *****************/
#define  OTG_FS_HOST_FNUM_FTREM                                  (uint32_t)(0xfffful << 16ul)//Frame time remaining
#define  OTG_FS_HOST_FNUM_FRNUM                                  (uint32_t)(0xfffful << 0ul) //Frame number

#define  OTG_FS_HOST_FNUM_FTREM_POS                              (uint32_t)(16ul)
#define  OTG_FS_HOST_FNUM_FRNUM_POS                              (uint32_t)(0ul)

/**************  Bit definition for OTG_FS_HOST_PTXSTS register  ***************/
#define  OTG_FS_HOST_PTXSTS_PTXQTOP                              (uint32_t)(0xfful << 24ul) //Top of the periodic transmit request queue
#define  OTG_FS_HOST_PTXSTS_PTXQSAV                              (uint32_t)(0xfful << 16ul) //Periodic transmit request queue space available
#define  OTG_FS_HOST_PTXSTS_PTXFSAVL                             (uint32_t)(0xfffful << 0ul)//Periodic transmit data FIFO space available

#define  OTG_FS_HOST_PTXSTS_PTXQTOP_ODD                         (uint32_t)(0x1ul << 31ul)   //Odd/Even frame
#define  OTG_FS_HOST_PTXSTS_PTXQTOP_CHANNEL                     (uint32_t)(0xful << 27ul)   //Channel number
#define  OTG_FS_HOST_PTXSTS_PTXQTOP_TYPE                        (uint32_t)(0x3ul << 25ul)   //Type
#define  OTG_FS_HOST_PTXSTS_PTXQTOP_TERMINATE                   (uint32_t)(0x1ul << 24ul)   //Terminate (last entry for the selected channel/endpoint)

#define  OTG_FS_HOST_PTXSTS_PTXQTOP_CHANNEL_POS                 (uint32_t)(27ul)

#define  OTG_FS_HOST_PTXSTS_PTXQTOP_TYPE_IN_OUT                 (uint32_t)(0x0ul << 25ul)   //IN/OUT
#define  OTG_FS_HOST_PTXSTS_PTXQTOP_TYPE_IN_ZERO_LENGTH         (uint32_t)(0x1ul << 25ul)   //Zero-length packet
#define  OTG_FS_HOST_PTXSTS_PTXQTOP_TYPE_DISABLE                (uint32_t)(0x3ul << 25ul)   //Disable channel command

