alexeyk13/rexos/drv/stm32/stm32_regsusb.h
#define  OTG_FS_HOST_PTXSTS_PTXQSAV_POS                         (uint32_t)(16ul)
#define  OTG_FS_HOST_PTXSTS_PTXFSAVL_POS                        (uint32_t)(0ul)

/**************  Bit definition for OTG_FS_HOST_AINT register  ****************/
#define  OTG_FS_HOST_AINT_HAINT                                 (uint32_t)(0xfffful << 0ul) //Channel interrupts

#define  OTG_FS_HOST_AINT_HAINT_0                               (uint32_t)(0x1ul << 0ul)
#define  OTG_FS_HOST_AINT_HAINT_1                               (uint32_t)(0x1ul << 1ul)
#define  OTG_FS_HOST_AINT_HAINT_2                               (uint32_t)(0x1ul << 2ul)
#define  OTG_FS_HOST_AINT_HAINT_3                               (uint32_t)(0x1ul << 3ul)
#define  OTG_FS_HOST_AINT_HAINT_4                               (uint32_t)(0x1ul << 4ul)
#define  OTG_FS_HOST_AINT_HAINT_5                               (uint32_t)(0x1ul << 5ul)
#define  OTG_FS_HOST_AINT_HAINT_6                               (uint32_t)(0x1ul << 6ul)
#define  OTG_FS_HOST_AINT_HAINT_7                               (uint32_t)(0x1ul << 7ul)
#define  OTG_FS_HOST_AINT_HAINT_8                               (uint32_t)(0x1ul << 8ul)
#define  OTG_FS_HOST_AINT_HAINT_9                               (uint32_t)(0x1ul << 9ul)
#define  OTG_FS_HOST_AINT_HAINT_10                              (uint32_t)(0x1ul << 10ul)
#define  OTG_FS_HOST_AINT_HAINT_11                              (uint32_t)(0x1ul << 11ul)
#define  OTG_FS_HOST_AINT_HAINT_12                              (uint32_t)(0x1ul << 12ul)
#define  OTG_FS_HOST_AINT_HAINT_13                              (uint32_t)(0x1ul << 13ul)
#define  OTG_FS_HOST_AINT_HAINT_14                              (uint32_t)(0x1ul << 14ul)
#define  OTG_FS_HOST_AINT_HAINT_15                              (uint32_t)(0x1ul << 15ul)

/************  Bit definition for OTG_FS_HOST_AINTMSK register  ***************/
#define  OTG_FS_HOST_AINTMSK_HAINTM                             (uint32_t)(0xfffful << 0ul) //Channel interrupts mask

#define  OTG_FS_HOST_AINTMSK_HAINTM_0                           (uint32_t)(0x1ul << 0ul)
#define  OTG_FS_HOST_AINTMSK_HAINTM_1                           (uint32_t)(0x1ul << 1ul)
#define  OTG_FS_HOST_AINTMSK_HAINTM_2                           (uint32_t)(0x1ul << 2ul)
#define  OTG_FS_HOST_AINTMSK_HAINTM_3                           (uint32_t)(0x1ul << 3ul)
#define  OTG_FS_HOST_AINTMSK_HAINTM_4                           (uint32_t)(0x1ul << 4ul)
#define  OTG_FS_HOST_AINTMSK_HAINTM_5                           (uint32_t)(0x1ul << 5ul)
#define  OTG_FS_HOST_AINTMSK_HAINTM_6                           (uint32_t)(0x1ul << 6ul)
#define  OTG_FS_HOST_AINTMSK_HAINTM_7                           (uint32_t)(0x1ul << 7ul)
#define  OTG_FS_HOST_AINTMSK_HAINTM_8                           (uint32_t)(0x1ul << 8ul)
#define  OTG_FS_HOST_AINTMSK_HAINTM_9                           (uint32_t)(0x1ul << 9ul)
#define  OTG_FS_HOST_AINTMSK_HAINTM_10                          (uint32_t)(0x1ul << 10ul)
#define  OTG_FS_HOST_AINTMSK_HAINTM_11                          (uint32_t)(0x1ul << 11ul)
#define  OTG_FS_HOST_AINTMSK_HAINTM_12                          (uint32_t)(0x1ul << 12ul)
#define  OTG_FS_HOST_AINTMSK_HAINTM_13                          (uint32_t)(0x1ul << 13ul)
#define  OTG_FS_HOST_AINTMSK_HAINTM_14                          (uint32_t)(0x1ul << 14ul)
#define  OTG_FS_HOST_AINTMSK_HAINTM_15                          (uint32_t)(0x1ul << 15ul)

/**************  Bit definition for OTG_FS_HOST_PRT register  ***************/
#define  OTG_FS_HOST_PRT_PSPD                                   (uint32_t)(0x3ul << 17ul) //Port speed
#define  OTG_FS_HOST_PRT_PTCTL                                  (uint32_t)(0xful << 13ul) //Port test control
#define  OTG_FS_HOST_PRT_PPWR                                   (uint32_t)(0x1ul << 12ul) //Port power
#define  OTG_FS_HOST_PRT_PLSTS                                  (uint32_t)(0x3ul << 10ul) //Port line status
#define  OTG_FS_HOST_PRT_PRST                                   (uint32_t)(0x1ul << 8ul)  //Port reset
#define  OTG_FS_HOST_PRT_PSUSP                                  (uint32_t)(0x1ul << 7ul)  //Port suspend
#define  OTG_FS_HOST_PRT_PRES                                   (uint32_t)(0x1ul << 6ul)  //Port resume
#define  OTG_FS_HOST_PRT_POCCHNG                                (uint32_t)(0x1ul << 5ul)  //Port overcurrent change
#define  OTG_FS_HOST_PRT_POCA                                   (uint32_t)(0x1ul << 4ul)  //Port overcurrent active
#define  OTG_FS_HOST_PRT_PENCHNG                                (uint32_t)(0x1ul << 3ul)  //Port enable/disable change
#define  OTG_FS_HOST_PRT_PENA                                   (uint32_t)(0x1ul << 2ul)  //Port enable
#define  OTG_FS_HOST_PRT_PCDET                                  (uint32_t)(0x1ul << 1ul)  //Port connect detected
#define  OTG_FS_HOST_PRT_PCSTS                                  (uint32_t)(0x1ul << 0ul)  //Port connect status

#define  OTG_FS_HOST_PRT_PSPD_FS                                (uint32_t)(0x1ul << 17ul) //Full speed
#define  OTG_FS_HOST_PRT_PSPD_LS                                (uint32_t)(0x2ul << 17ul) //Low speed

#define  OTG_FS_HOST_PRT_PTCTL_DISABLED                         (uint32_t)(0x0ul << 13ul) //Test mode disabled
#define  OTG_FS_HOST_PRT_PTCTL_J                                (uint32_t)(0x1ul << 13ul) //J mode
#define  OTG_FS_HOST_PRT_PTCTL_K                                (uint32_t)(0x2ul << 13ul) //K mode
#define  OTG_FS_HOST_PRT_PTCTL_SE0_NAK                          (uint32_t)(0x3ul << 13ul) //Se0 NAK mode
#define  OTG_FS_HOST_PRT_PTCTL_PACKET                           (uint32_t)(0x4ul << 13ul) //Packet mode
#define  OTG_FS_HOST_PRT_PTCTL_FORCE_ENABLE                     (uint32_t)(0x5ul << 13ul) //Force enable

#define  OTG_FS_HOST_PRT_PLSTS_DP                               (uint32_t)(0x1ul << 10ul) //Logic level of OTG_FS_FS_DP
#define  OTG_FS_HOST_PRT_PLSTS_DM                               (uint32_t)(0x1ul << 11ul) //Logic level of OTG_FS_FS_DM

/**********  Bit definition for OTG_FS_HOST_CHANNEL_CHAR register  ***************/
#define  OTG_FS_HOST_CHANNEL_CHAR_CHENA                         (uint32_t)(0x1ul << 31ul) //Channel enable
#define  OTG_FS_HOST_CHANNEL_CHAR_CHDIS                         (uint32_t)(0x1ul << 30ul) //Channel disable
#define  OTG_FS_HOST_CHANNEL_CHAR_ODDFRM                        (uint32_t)(0x1ul << 29ul) //ODD frame
#define  OTG_FS_HOST_CHANNEL_CHAR_DAD                           (uint32_t)(0x7ful << 22ul)//Device address
#define  OTG_FS_HOST_CHANNEL_CHAR_MC                            (uint32_t)(0x3ul << 20ul) //Multi Count (MC) / Error Count (EC)
#define  OTG_FS_HOST_CHANNEL_CHAR_EPTYP                         (uint32_t)(0x2ul << 18ul) //Endpoint type
#define  OTG_FS_HOST_CHANNEL_CHAR_LSDEV                         (uint32_t)(0x1ul << 17ul) //Low speed device
#define  OTG_FS_HOST_CHANNEL_CHAR_EPDIR                         (uint32_t)(0x1ul << 15ul) //Endpoint direction
#define  OTG_FS_HOST_CHANNEL_CHAR_EPNUM                         (uint32_t)(0xful << 11ul) //Endpoint number
#define  OTG_FS_HOST_CHANNEL_CHAR_MPSIZ                         (uint32_t)(0x7fful << 0ul)//Maximum packet size

#define  OTG_FS_HOST_CHANNEL_CHAR_DAD_POS                       (uint32_t)(22ul)
#define  OTG_FS_HOST_CHANNEL_CHAR_MC_POS                        (uint32_t)(20ul)

