alexeyk13/rexos/drv/stm32/stm32_regsusb.h
#define  OTG_FS_HOST_CHANNEL_CHAR_EPTYP_CONTROL                 (uint32_t)(0x0ul << 18ul) //Control endpoint type
#define  OTG_FS_HOST_CHANNEL_CHAR_EPTYP_ISOCHRONOUS             (uint32_t)(0x1ul << 18ul) //Isochronous endpoint type
#define  OTG_FS_HOST_CHANNEL_CHAR_EPTYP_BULK                    (uint32_t)(0x2ul << 18ul) //Bulk endpoint type
#define  OTG_FS_HOST_CHANNEL_CHAR_EPTYP_INTERRUPT               (uint32_t)(0x3ul << 18ul) //Interrupt endpoint type

#define  OTG_FS_HOST_CHANNEL_CHAR_EPNUM_POS                     (uint32_t)(11ul)
#define  OTG_FS_HOST_CHANNEL_CHAR_MPSIZ_POS                     (uint32_t)(0ul)

/**********  Bit definition for OTG_FS_HOST_CHANNEL_INT register  ****************/
#define  OTG_FS_HOST_CHANNEL_INT_DTERR                          (uint32_t)(0x1ul << 10ul) //Data toggle error
#define  OTG_FS_HOST_CHANNEL_INT_FRMOR                          (uint32_t)(0x1ul << 9ul)  //Frame overrun
#define  OTG_FS_HOST_CHANNEL_INT_BBERR                          (uint32_t)(0x1ul << 8ul)  //Babble error
#define  OTG_FS_HOST_CHANNEL_INT_TXERR                          (uint32_t)(0x1ul << 7ul)  //Transaction error
#define  OTG_FS_HOST_CHANNEL_INT_ACK                            (uint32_t)(0x1ul << 5ul)  //ACK response received/transmitted interrupt
#define  OTG_FS_HOST_CHANNEL_INT_NAK                            (uint32_t)(0x1ul << 4ul)  //NAK response received interrupt
#define  OTG_FS_HOST_CHANNEL_INT_STALL                          (uint32_t)(0x1ul << 3ul)  //STALL response received interrupt
#define  OTG_FS_HOST_CHANNEL_INT_CHH                            (uint32_t)(0x1ul << 1ul)  //Channel halted
#define  OTG_FS_HOST_CHANNEL_INT_XFRC                           (uint32_t)(0x1ul << 0ul)  //Transfer completed

/**********  Bit definition for OTG_FS_HOST_CHANNEL_INTMSK register  *************/
#define  OTG_FS_HOST_CHANNEL_INTMSK_DTERRM                      (uint32_t)(0x1ul << 10ul) //Data toggle error interrupt mask
#define  OTG_FS_HOST_CHANNEL_INTMSK_FRMORM                      (uint32_t)(0x1ul << 9ul)  //Frame overrun interrupt mask
#define  OTG_FS_HOST_CHANNEL_INTMSK_BBERR                       (uint32_t)(0x1ul << 8ul)  //Babble error interrupt mask
#define  OTG_FS_HOST_CHANNEL_INTMSK_TXERRM                      (uint32_t)(0x1ul << 7ul)  //Transaction error interrupt mask
#define  OTG_FS_HOST_CHANNEL_INTMSK_ACKM                        (uint32_t)(0x1ul << 5ul)  //ACK response received/transmitted interrupt mask
#define  OTG_FS_HOST_CHANNEL_INTMSK_NAKM                        (uint32_t)(0x1ul << 4ul)  //NAK response received interrupt mask
#define  OTG_FS_HOST_CHANNEL_INTMSK_STALLM                      (uint32_t)(0x1ul << 3ul)  //STALL response received interrupt mask
#define  OTG_FS_HOST_CHANNEL_INTMSK_CHHM                        (uint32_t)(0x1ul << 1ul)  //Channel halted interrupt mask
#define  OTG_FS_HOST_CHANNEL_INTMSK_XFRCM                       (uint32_t)(0x1ul << 0ul)  //Transfer completed interrupt mask

/**********  Bit definition for OTG_FS_HOST_CHANNEL_TSIZ register  ***************/
#define  OTG_FS_HOST_CHANNEL_TSIZ_DPID                          (uint32_t)(0x3ul << 29ul) //Data PID
#define  OTG_FS_HOST_CHANNEL_TSIZ_PKTCNT                        (uint32_t)(0x3fful << 19ul)//Packet count
#define  OTG_FS_HOST_CHANNEL_TSIZ_XFRSIZ                        (uint32_t)(0x7fffful << 0ul)//Transfer size

#define  OTG_FS_HOST_CHANNEL_TSIZ_DPID_DATA0                    (uint32_t)(0x0ul << 29ul) //DATA0
#define  OTG_FS_HOST_CHANNEL_TSIZ_DPID_DATA2                    (uint32_t)(0x1ul << 29ul) //DATA2
#define  OTG_FS_HOST_CHANNEL_TSIZ_DPID_DATA1                    (uint32_t)(0x2ul << 29ul) //DATA1
#define  OTG_FS_HOST_CHANNEL_TSIZ_DPID_MDATA_SETUP              (uint32_t)(0x3ul << 29ul) //MDATA (noncontrol)/SETUP (control)

#define  OTG_FS_HOST_CHANNEL_TSIZ_PKTCNT_POS                    (uint32_t)(19ul)
#define  OTG_FS_HOST_CHANNEL_TSIZ_XFRSIZ_POS                    (uint32_t)(0ul)

/******************************************************************************/
/*                                                                            */
/*                            USB Full Speed DEVICE                           */
/*                                                                            */
/******************************************************************************/
/**************  Bit definition for OTG_FS_DEVICE_CFG register  ***************/
#define  OTG_FS_DEVICE_CFG_PFIVL                                (uint32_t)(3ul << 11ul)      //Periodic frame interval
#define  OTG_FS_DEVICE_CFG_DAD                                  (uint32_t)(0x7ful << 4ul)      //Device address
#define  OTG_FS_DEVICE_CFG_NZLSOHSK                             (uint32_t)(1ul << 2ul)      //Non-zero length status OUT handshake
#define  OTG_FS_DEVICE_CFG_DSPD                                 (uint32_t)(3ul << 0ul)      //Device speed

#define  OTG_FS_DEVICE_CFG_PFIVL_80                             (uint32_t)(0ul << 11ul)      //80% of micro(frame)
#define  OTG_FS_DEVICE_CFG_PFIVL_85                             (uint32_t)(1ul << 11ul)      //85% of micro(frame)
#define  OTG_FS_DEVICE_CFG_PFIVL_90                             (uint32_t)(2ul << 11ul)      //90% of micro(frame)
#define  OTG_FS_DEVICE_CFG_PFIVL_95                             (uint32_t)(3ul << 11ul)      //95% of micro(frame)

#define  OTG_FS_DEVICE_CFG_DAD_POS                              (uint32_t)(4ul)

#define  OTG_FS_DEVICE_CFG_DSPD_FS                              (uint32_t)(3ul << 0ul)      //Full speed (USB tranceiver clock is 48MHz)

/**************  Bit definition for OTG_FS_DEVICE_CTL register  ***************/
#define  OTG_FS_DEVICE_CTL_POPRGDNE                             (uint32_t)(1ul << 11ul)      //Power-on programming done
#define  OTG_FS_DEVICE_CTL_CGONAK                               (uint32_t)(1ul << 10ul)      //Clear global OUT NAK
#define  OTG_FS_DEVICE_CTL_SGONAK                               (uint32_t)(1ul << 9ul)      //Set global OUT NAK
#define  OTG_FS_DEVICE_CTL_CGINAK                               (uint32_t)(1ul << 8ul)      //Clear global IN NAK
#define  OTG_FS_DEVICE_CTL_SGINAK                               (uint32_t)(1ul << 7ul)      //Set global IN NAK
#define  OTG_FS_DEVICE_CTL_TCTL                                 (uint32_t)(7ul << 4ul)      //Test control
#define  OTG_FS_DEVICE_CTL_GONSTS                               (uint32_t)(1ul << 3ul)      //Global OUT NAK status
#define  OTG_FS_DEVICE_CTL_GINSTS                               (uint32_t)(1ul << 2ul)      //Global IN NAK status
#define  OTG_FS_DEVICE_CTL_SDIS                                 (uint32_t)(1ul << 1ul)      //Soft disconnect
#define  OTG_FS_DEVICE_CTL_RWUSIG                               (uint32_t)(1ul << 0ul)      //Remote wakeup signaling

#define  OTG_FS_DEVICE_CTL_TCTL_DISABLED                        (uint32_t)(0x0ul << 4ul)  //Test mode disabled
#define  OTG_FS_DEVICE_CTL_TCTL_J                               (uint32_t)(0x1ul << 4ul)  //J mode
#define  OTG_FS_DEVICE_CTL_TCTL_K                               (uint32_t)(0x2ul << 4ul)  //K mode
#define  OTG_FS_DEVICE_CTL_TCTL_SE0_NAK                         (uint32_t)(0x3ul << 4ul)  //Se0 NAK mode
#define  OTG_FS_DEVICE_CTL_TCTL_PACKET                          (uint32_t)(0x4ul << 4ul)  //Packet mode
#define  OTG_FS_DEVICE_CTL_TCTL_FORCE_ENABLE                    (uint32_t)(0x5ul << 4ul)  //Force enable
#define  OTG_FS_DEVICE_CTL_TCTL_POS                             4ul

/**************  Bit definition for OTG_FS_DEVICE_STS register  ***************/
#define  OTG_FS_DEVICE_STS_FNSOF                                (uint32_t)(0x3ffful << 8ul)//Frame number of received SOF
#define  OTG_FS_DEVICE_STS_EERR                                 (uint32_t)(1ul << 3ul)        //Erratic error
#define  OTG_FS_DEVICE_STS_ENUMSPD                              (uint32_t)(3ul << 1ul)        //Enumerated speed
#define  OTG_FS_DEVICE_STS_SUSPSTS                              (uint32_t)(1ul << 0ul)        //Suspend status

#define  OTG_FS_DEVICE_STS_FNSOF_POS                            (uint32_t)(8ul)

#define  OTG_FS_DEVICE_STS_ENUMSPD_FS                           (uint32_t)(3ul << 1ul)        //Full speed (PHY clock is running on 48MHz)

/************  Bit definition for OTG_FS_DEVICE_IEPMSK register  ***************/
#define  OTG_FS_DEVICE_IEPMSK_INEPNEM                           (uint32_t)(1ul << 6ul)        //IN endpoint NAK effective mask
#define  OTG_FS_DEVICE_IEPMSK_INEPNMM                           (uint32_t)(1ul << 5ul)        //IN token receive with EP mismatch mask
#define  OTG_FS_DEVICE_IEPMSK_ITTXFEMSK                         (uint32_t)(1ul << 4ul)        //IN token receive when TxFIFO empty mask
#define  OTG_FS_DEVICE_IEPMSK_TOCM                              (uint32_t)(1ul << 3ul)        //Timeout condition mask (nonisochronous endpoint)
#define  OTG_FS_DEVICE_IEPMSK_EPDM                              (uint32_t)(1ul << 1ul)        //Endpoint disabled interrupt mask
#define  OTG_FS_DEVICE_IEPMSK_XFRCM                             (uint32_t)(1ul << 0ul)        //Transfer completed interrupt mask

/************  Bit definition for OTG_FS_DEVICE_OEPMSK register  ***************/
#define  OTG_FS_DEVICE_OEPMSK_OTEPDM                            (uint32_t)(1ul << 4ul)        //OUT token received when endpoint disabled mask
#define  OTG_FS_DEVICE_OEPMSK_STUPM                             (uint32_t)(1ul << 3ul)        //SETUP phase done mask
#define  OTG_FS_DEVICE_OEPMSK_EPDM                              (uint32_t)(1ul << 1ul)        //Endpoint disabled interrupt mask
#define  OTG_FS_DEVICE_OEPMSK_XFRCM                             (uint32_t)(1ul << 0ul)        //Transfer completed interrupt mask

/************  Bit definition for OTG_FS_DEVICE_AINT register  *****************/
#define  OTG_FS_DEVICE_AINT_OEPINT                              (uint32_t)(0xfffful << 16ul)//OUT endpoint interrupt bits
#define  OTG_FS_DEVICE_AINT_IEPINT                              (uint32_t)(0xfffful << 0ul) //IN endpoint interrupt bits

#define  OTG_FS_DEVICE_AINT_OEPINT_POS                          (uint32_t)(16ul)
#define  OTG_FS_DEVICE_AINT_IEPINT_POS                          (uint32_t)(0ul)

#define  OTG_FS_DEVICE_AINT_OEPINT_0                            (uint32_t)(1ul << 16ul)
#define  OTG_FS_DEVICE_AINT_OEPINT_1                            (uint32_t)(1ul << 17ul)
#define  OTG_FS_DEVICE_AINT_OEPINT_2                            (uint32_t)(1ul << 18ul)
#define  OTG_FS_DEVICE_AINT_OEPINT_3                            (uint32_t)(1ul << 19ul)
#define  OTG_FS_DEVICE_AINT_OEPINT_4                            (uint32_t)(1ul << 20ul)
#define  OTG_FS_DEVICE_AINT_OEPINT_5                            (uint32_t)(1ul << 21ul)
#define  OTG_FS_DEVICE_AINT_OEPINT_6                            (uint32_t)(1ul << 22ul)
#define  OTG_FS_DEVICE_AINT_OEPINT_7                            (uint32_t)(1ul << 23ul)
#define  OTG_FS_DEVICE_AINT_OEPINT_8                            (uint32_t)(1ul << 24ul)
#define  OTG_FS_DEVICE_AINT_OEPINT_9                            (uint32_t)(1ul << 25ul)
#define  OTG_FS_DEVICE_AINT_OEPINT_10                           (uint32_t)(1ul << 26ul)
#define  OTG_FS_DEVICE_AINT_OEPINT_11                           (uint32_t)(1ul << 27ul)
#define  OTG_FS_DEVICE_AINT_OEPINT_12                           (uint32_t)(1ul << 28ul)
#define  OTG_FS_DEVICE_AINT_OEPINT_13                           (uint32_t)(1ul << 29ul)
#define  OTG_FS_DEVICE_AINT_OEPINT_14                           (uint32_t)(1ul << 30ul)
#define  OTG_FS_DEVICE_AINT_OEPINT_15                           (uint32_t)(1ul << 31ul)

#define  OTG_FS_DEVICE_AINT_IEPINT_0                            (uint32_t)(1ul << 0ul)
#define  OTG_FS_DEVICE_AINT_IEPINT_1                            (uint32_t)(1ul << 1ul)
#define  OTG_FS_DEVICE_AINT_IEPINT_2                            (uint32_t)(1ul << 2ul)
#define  OTG_FS_DEVICE_AINT_IEPINT_3                            (uint32_t)(1ul << 3ul)
#define  OTG_FS_DEVICE_AINT_IEPINT_4                            (uint32_t)(1ul << 4ul)
#define  OTG_FS_DEVICE_AINT_IEPINT_5                            (uint32_t)(1ul << 5ul)
#define  OTG_FS_DEVICE_AINT_IEPINT_6                            (uint32_t)(1ul << 6ul)
#define  OTG_FS_DEVICE_AINT_IEPINT_7                            (uint32_t)(1ul << 7ul)
#define  OTG_FS_DEVICE_AINT_IEPINT_8                            (uint32_t)(1ul << 8ul)
#define  OTG_FS_DEVICE_AINT_IEPINT_9                            (uint32_t)(1ul << 9ul)
#define  OTG_FS_DEVICE_AINT_IEPINT_10                           (uint32_t)(1ul << 10ul)
#define  OTG_FS_DEVICE_AINT_IEPINT_11                           (uint32_t)(1ul << 11ul)
#define  OTG_FS_DEVICE_AINT_IEPINT_12                           (uint32_t)(1ul << 12ul)
#define  OTG_FS_DEVICE_AINT_IEPINT_13                           (uint32_t)(1ul << 13ul)
#define  OTG_FS_DEVICE_AINT_IEPINT_14                           (uint32_t)(1ul << 14ul)
#define  OTG_FS_DEVICE_AINT_IEPINT_15                           (uint32_t)(1ul << 15ul)

