alexeyk13/rexos/drv/stm32/stm32_regsusb.h
/************  Bit definition for OTG_FS_DEVICE_AINTMSK register  *****************/
#define  OTG_FS_DEVICE_AINTMSK_OEPINTM                          (uint32_t)(0xfffful << 16ul)//OUT endpoint interrupt mask bits
#define  OTG_FS_DEVICE_AINTMSK_IEPINTM                          (uint32_t)(0xfffful << 0ul) //IN endpoint interrupt mask bits

#define  OTG_FS_DEVICE_AINTMSK_OEPINTM_POS                      (uint32_t)(16ul)
#define  OTG_FS_DEVICE_AINTMSK_IEPINTM_POS                      (uint32_t)(0ul)

#define  OTG_FS_DEVICE_AINTMSK_OEPINTM_0                        (uint32_t)(1ul << 16ul)
#define  OTG_FS_DEVICE_AINTMSK_OEPINTM_1                        (uint32_t)(1ul << 17ul)
#define  OTG_FS_DEVICE_AINTMSK_OEPINTM_2                        (uint32_t)(1ul << 18ul)
#define  OTG_FS_DEVICE_AINTMSK_OEPINTM_3                        (uint32_t)(1ul << 19ul)
#define  OTG_FS_DEVICE_AINTMSK_OEPINTM_4                        (uint32_t)(1ul << 20ul)
#define  OTG_FS_DEVICE_AINTMSK_OEPINTM_5                        (uint32_t)(1ul << 21ul)
#define  OTG_FS_DEVICE_AINTMSK_OEPINTM_6                        (uint32_t)(1ul << 22ul)
#define  OTG_FS_DEVICE_AINTMSK_OEPINTM_7                        (uint32_t)(1ul << 23ul)
#define  OTG_FS_DEVICE_AINTMSK_OEPINTM_8                        (uint32_t)(1ul << 24ul)
#define  OTG_FS_DEVICE_AINTMSK_OEPINTM_9                        (uint32_t)(1ul << 25ul)
#define  OTG_FS_DEVICE_AINTMSK_OEPINTM_10                       (uint32_t)(1ul << 26ul)
#define  OTG_FS_DEVICE_AINTMSK_OEPINTM_11                       (uint32_t)(1ul << 27ul)
#define  OTG_FS_DEVICE_AINTMSK_OEPINTM_12                       (uint32_t)(1ul << 28ul)
#define  OTG_FS_DEVICE_AINTMSK_OEPINTM_13                       (uint32_t)(1ul << 29ul)
#define  OTG_FS_DEVICE_AINTMSK_OEPINTM_14                       (uint32_t)(1ul << 30ul)
#define  OTG_FS_DEVICE_AINTMSK_OEPINTM_15                       (uint32_t)(1ul << 31ul)

#define  OTG_FS_DEVICE_AINTMSK_IEPINTM_0                        (uint32_t)(1ul << 0ul)
#define  OTG_FS_DEVICE_AINTMSK_IEPINTM_1                        (uint32_t)(1ul << 1ul)
#define  OTG_FS_DEVICE_AINTMSK_IEPINTM_2                        (uint32_t)(1ul << 2ul)
#define  OTG_FS_DEVICE_AINTMSK_IEPINTM_3                        (uint32_t)(1ul << 3ul)
#define  OTG_FS_DEVICE_AINTMSK_IEPINTM_4                        (uint32_t)(1ul << 4ul)
#define  OTG_FS_DEVICE_AINTMSK_IEPINTM_5                        (uint32_t)(1ul << 5ul)
#define  OTG_FS_DEVICE_AINTMSK_IEPINTM_6                        (uint32_t)(1ul << 6ul)
#define  OTG_FS_DEVICE_AINTMSK_IEPINTM_7                        (uint32_t)(1ul << 7ul)
#define  OTG_FS_DEVICE_AINTMSK_IEPINTM_8                        (uint32_t)(1ul << 8ul)
#define  OTG_FS_DEVICE_AINTMSK_IEPINTM_9                        (uint32_t)(1ul << 9ul)
#define  OTG_FS_DEVICE_AINTMSK_IEPINTM_10                       (uint32_t)(1ul << 10ul)
#define  OTG_FS_DEVICE_AINTMSK_IEPINTM_11                       (uint32_t)(1ul << 11ul)
#define  OTG_FS_DEVICE_AINTMSK_IEPINTM_12                       (uint32_t)(1ul << 12ul)
#define  OTG_FS_DEVICE_AINTMSK_IEPINTM_13                       (uint32_t)(1ul << 13ul)
#define  OTG_FS_DEVICE_AINTMSK_IEPINTM_14                       (uint32_t)(1ul << 14ul)
#define  OTG_FS_DEVICE_AINTMSK_IEPINTM_15                       (uint32_t)(1ul << 15ul)

/************  Bit definition for OTG_FS_DEVICE_VBUSDIS register  ***************/
#define  OTG_FS_DEVICE_VBUSDIS_VBUSDT                           (uint32_t)(0xfffful << 0ul) //VBus discharge time

#define  OTG_FS_DEVICE_VBUSDIS_VBUSDT_POS                       (uint32_t)(0ul)

/************  Bit definition for OTG_FS_DEVICE_VBUSPULSE register  ***************/
#define  OTG_FS_DEVICE_VBUSPULSE_VBUSP                          (uint32_t)(0xffful << 0ul) //VBus pulse time

#define  OTG_FS_DEVICE_VBUSPULSE_VBUSP_POS                      (uint32_t)(0ul)

/************  Bit definition for OTG_FS_DEVICE_IEPEMPMSK register  ***************/
#define  OTG_FS_DEVICE_IEPEMPMSK_INEPTXFEM                      (uint32_t)(0xfffful << 0ul)//IN EP TxFIFO empty interrupt mask bits

#define  OTG_FS_DEVICE_IEPEMPMSK_INEPTXFEM_POS                  (uint32_t)(0ul)

/************  Bit definition for OTG_FS_DEVICE_ENDPOINT_CTL register  **************/
#define  OTG_FS_DEVICE_ENDPOINT_CTL_EPENA                       (uint32_t)(1ul << 31ul)        //EP enable
#define  OTG_FS_DEVICE_ENDPOINT_CTL_EPDIS                       (uint32_t)(1ul << 30ul)        //EP disable
#define  OTG_FS_DEVICE_ENDPOINT_CTL_SODDFRM                     (uint32_t)(1ul << 29ul)        //Isochronous: set odd frame
#define  OTG_FS_DEVICE_ENDPOINT_CTL_SD0PID                      (uint32_t)(1ul << 28ul)        //Interrupt/bulk: set DATA0 PID
#define  OTG_FS_DEVICE_ENDPOINT_CTL_SEVNFRM                     (uint32_t)(1ul << 28ul)        //Isochronous: set even frame
#define  OTG_FS_DEVICE_ENDPOINT_CTL_SNAK                        (uint32_t)(1ul << 27ul)        //Set NAK
#define  OTG_FS_DEVICE_ENDPOINT_CTL_CNAK                        (uint32_t)(1ul << 26ul)        //Clear NAK
#define  OTG_FS_DEVICE_ENDPOINT_CTL_TXFNUM                      (uint32_t)(0xful << 22ul)    //TX FIFO NUM
#define  OTG_FS_DEVICE_ENDPOINT_CTL_TXFNUM_POS                  (uint32_t)(22ul)
#define  OTG_FS_DEVICE_ENDPOINT_CTL_STALL                       (uint32_t)(1ul << 21ul)        //Set STALL
#define  OTG_FS_DEVICE_ENDPOINT_CTL_SNPM                        (uint32_t)(1ul << 20ul)        //Snoop mode
#define  OTG_FS_DEVICE_ENDPOINT_CTL_EPTYP                       (uint32_t)(3ul << 18ul)        //EP type
#define  OTG_FS_DEVICE_ENDPOINT_CTL_NAKSTS                      (uint32_t)(1ul << 17ul)        //NAK status
#define  OTG_FS_DEVICE_ENDPOINT_CTL_EONUM                       (uint32_t)(1ul << 16ul)        //Isochronous: even/odd frame
#define  OTG_FS_DEVICE_ENDPOINT_CTL_DPID                        (uint32_t)(1ul << 16ul)        //Interrupt/bulk: data PID
#define  OTG_FS_DEVICE_ENDPOINT_CTL_USBAEP                      (uint32_t)(1ul << 15ul)        //USB active endpoint
#define  OTG_FS_DEVICE_ENDPOINT_CTL_MPSIZ                       (uint32_t)(0x7fful << 0ul)    //Maximum packet size
#define  OTG_FS_DEVICE_ENDPOINT_CTL_MPSIZ0                      (uint32_t)(3ul << 0ul)        //Maximum packet size for EP0

#define  OTG_FS_DEVICE_ENDPOINT_CTL_EPTYP_CONTROL               (uint32_t)(0ul << 18ul)        //Control EP type
#define  OTG_FS_DEVICE_ENDPOINT_CTL_EPTYP_ISOCHRONOUS           (uint32_t)(1ul << 18ul)        //Isochronous EP type
#define  OTG_FS_DEVICE_ENDPOINT_CTL_EPTYP_BULK                  (uint32_t)(2ul << 18ul)        //Bulk EP type
#define  OTG_FS_DEVICE_ENDPOINT_CTL_EPTYP_INTERRUPT             (uint32_t)(3ul << 18ul)        //Interrupt EP type
#define  OTG_FS_DEVICE_ENDPOINT_CTL_EPTYP_POS                   18ul

#define  OTG_FS_DEVICE_ENDPOINT_CTL_MPSIZ0_64                   (uint32_t)(0x0ul << 0ul)    //EP0 maximum packet size 64 bytes
#define  OTG_FS_DEVICE_ENDPOINT_CTL_MPSIZ0_32                   (uint32_t)(0x1ul << 0ul)    //EP0 maximum packet size 32 bytes
#define  OTG_FS_DEVICE_ENDPOINT_CTL_MPSIZ0_16                   (uint32_t)(0x2ul << 0ul)    //EP0 maximum packet size 16 bytes
#define  OTG_FS_DEVICE_ENDPOINT_CTL_MPSIZ0_8                    (uint32_t)(0x3ul << 0ul)    //EP0 maximum packet size 8 bytes

/************  Bit definition for OTG_FS_DEVICE_ENDPOINT_INT register  *************/
#define  OTG_FS_DEVICE_ENDPOINT_INT_TXFE                        (uint32_t)(1ul << 7ul)        //Tx FIFO empty
#define  OTG_FS_DEVICE_ENDPOINT_INT_INEPNE                      (uint32_t)(1ul << 6ul)        //IN: endpoint NAK effective
#define  OTG_FS_DEVICE_ENDPOINT_INT_B2BSTUP                     (uint32_t)(1ul << 6ul)        //OUT: back-to-back SETUP packets received
#define  OTG_FS_DEVICE_ENDPOINT_INT_ITXFE                       (uint32_t)(1ul << 4ul)        //IN: token received, when TxFIFO empty
#define  OTG_FS_DEVICE_ENDPOINT_INT_OTEPDIS                     (uint32_t)(1ul << 4ul)        //OUT: token received when endpoint disabled
#define  OTG_FS_DEVICE_ENDPOINT_INT_TOC                         (uint32_t)(1ul << 3ul)        //IN: timeout condition
#define  OTG_FS_DEVICE_ENDPOINT_INT_STUP                        (uint32_t)(1ul << 3ul)        //OUT: setup phase done
#define  OTG_FS_DEVICE_ENDPOINT_INT_EPDISD                      (uint32_t)(1ul << 1ul)        //Endpoint disabled interrupt
#define  OTG_FS_DEVICE_ENDPOINT_INT_XFRC                        (uint32_t)(1ul << 0ul)        //Transfer completed interrupt

/************  Bit definition for OTG_FS_DEVICE_ENDPOINT_TSIZ register  *************/
#define  OTG_FS_DEVICE_ENDPOINT_TSIZ_PKTCNT_IN0                 (uint32_t)(3ul << 19ul)        //IN0: packets count
#define  OTG_FS_DEVICE_ENDPOINT_TSIZ_XFRSIZ_IN0                 (uint32_t)(0x7ful << 0ul)    //IN0: transfer size

#define  OTG_FS_DEVICE_ENDPOINT_TSIZ_STUPCNT_OUT0               (uint32_t)(3ul << 29ul)        //OUT0: setup packets count
#define  OTG_FS_DEVICE_ENDPOINT_TSIZ_PKTCNT_OUT0                (uint32_t)(1ul << 19ul)        //OUT0: packets count
#define  OTG_FS_DEVICE_ENDPOINT_TSIZ_XFRSIZ_OUT0                (uint32_t)(0x7ful << 0ul)    //OUT0: transfer size

#define  OTG_FS_DEVICE_ENDPOINT_TSIZ_MCNT                       (uint32_t)(3ul << 29ul)        //multi count
#define  OTG_FS_DEVICE_ENDPOINT_TSIZ_RXDPID                     (uint32_t)(3ul << 29ul)        //received data pid
#define  OTG_FS_DEVICE_ENDPOINT_TSIZ_PKTCNT                     (uint32_t)(0x3ful << 19ul)    //packets count
#define  OTG_FS_DEVICE_ENDPOINT_TSIZ_XFRSIZ                     (uint32_t)(0x7ffful << 0ul)//transfer size

