alexeyk13/rexos/drv/stm32/stm32_regsusb.h
#define  OTG_FS_DEVICE_ENDPOINT_TSIZ_RXDPID_DATA0               (uint32_t)(0ul << 29ul)        //DATA0
#define  OTG_FS_DEVICE_ENDPOINT_TSIZ_RXDPID_DATA2               (uint32_t)(1ul << 29ul)        //DATA2
#define  OTG_FS_DEVICE_ENDPOINT_TSIZ_RXDPID_DATA1               (uint32_t)(2ul << 29ul)        //DATA1
#define  OTG_FS_DEVICE_ENDPOINT_TSIZ_RXDPID_MDATA               (uint32_t)(3ul << 29ul)        //MDATA

#define  OTG_FS_DEVICE_ENDPOINT_TSIZ_MCNT_POS                   (uint32_t)(29ul)
#define  OTG_FS_DEVICE_ENDPOINT_TSIZ_STUPCNT_OUT0_POS           (uint32_t)(29ul)
#define  OTG_FS_DEVICE_ENDPOINT_TSIZ_PKTCNT_POS                 (uint32_t)(19ul)
#define  OTG_FS_DEVICE_ENDPOINT_TSIZ_XFRSIZ_POS                 (uint32_t)(0ul)

/************  Bit definition for OTG_FS_DEVICE_ENDPOINT_FSTS register  *************/
#define  OTG_FS_DEVICE_ENDPOINT_FSTS_INEPTFSAV                  (uint32_t)(0xfffful << 0ul)    //IN EP TxFIFO space available

#define  OTG_FS_DEVICE_ENDPOINT_FSTS_INEPTFSAV_POS              (uint32_t)(0ul)

/******************************************************************************/
/*                                                                            */
/*                            USB Full Speed POWER & CLOCK                    */
/*                                                                            */
/******************************************************************************/
/************  Bit definition for OTG_FS_PC_GCCTL register  *******************/
#define  OTG_FS_PC_GCCTL_PHYSUSP                                (uint32_t)(1ul << 4ul) //phy suspended
#define  OTG_FS_PC_GCCTL_GATEHCLK                               (uint32_t)(1ul << 1ul) //Gate HCLK
#define  OTG_FS_PC_GCCTL_STPPCLK                                (uint32_t)(1ul << 0ul) //Stop PHY clock



#endif // STM32_REGSUSB_H
